[
    {
        "mmsId": "9952373351801401",
        "isbn": "9780262539739",
        "title": "Your Computer Is On Fire",
        "author": "",
        "recStatus": "Yes",
        "recDate": "2023-10-24",
        "callNo": "Unknown",
        "summary": "Technology scholars declare an emergency: attention must be paid to the inequality, marginalization, and biases woven into our technological systems. This book sounds an alarm: we can no longer afford to be lulled into complacency by narratives of techno-utopianism, or even techno-neutrality. We should not be reassured by such soothing generalities as \"human error,\" \"virtual reality,\" or \"the cloud.\" We need to realize that nothing is virtual: everything that \"happens online,\" \"virtually,\" or \"autonomously\" happens offline first, and often involves human beings whose labor is deliberately kept invisible. Everything is IRL. In Your Computer Is on Fire, technology scholars train a spotlight on the inequality, marginalization, and biases woven into our technological systems.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780262539739-L.jpg"
    },
    {
        "mmsId": "9952373352201401",
        "isbn": "9781421437897",
        "title": "Political Determinants Of Health.",
        "author": "Dawes, Daniel E., 1980-",
        "recStatus": "Yes",
        "recDate": "2023-10-24",
        "callNo": "Unknown",
        "summary": "A thought-provoking and evocative account that considers both the policies we think of as \"health policyand those that we don't, The Political Determinants of Health provides a novel, multidisciplinary framework for addressing the systemic barriers preventing the United States from becoming the healthiest nation in the world.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781421437897-L.jpg"
    },
    {
        "mmsId": "9952373352301401",
        "isbn": "9781938841361",
        "title": "Unwieldy Creatures.",
        "author": "Tsai, Addie",
        "recStatus": "Yes",
        "recDate": "2023-10-24",
        "callNo": "Unknown",
        "summary": "Unwieldy Creatures, a biracial, queer, gender-swapped retelling of Mary Shelley's classic novel Frankenstein, follows the story of three beings who all navigate life from the margins: Plum, a queer biracial Chinese intern at one of the world's top embryology labs, who runs away from home to openly be with her girlfriend only to be left on her own; Dr. Frank, a queer biracial Indonesian scientist, who compromises everything she claims to love in the name of science and ambition when she sets out to procreate without sperm or egg; and Dr. Frank's nonbinary creation who, painstakingly brought into the world, is abandoned due to complications at birth that result from a cruel twist of revenge. Plum struggles to determine the limits of her own ambition when Dr. Frank offers her a chance to assist with her next project. How far will Plum go in the name of scientific advancement and what is she willing to risk?",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781938841361-L.jpg"
    },
    {
        "mmsId": "9952373352401401",
        "isbn": "9780593466629",
        "title": "Swimmers: A Novel.",
        "author": "Otsuka, Julie",
        "recStatus": "Yes",
        "recDate": "2023-10-24",
        "callNo": "Unknown",
        "summary": "NATIONAL BESTSELLER • From the best-selling, award-winning author of The Buddha in the Attic and When the Emperor Was Divine comes a novel that \"starts as a catalogue of spoken and unspoken rules for swimmers at an aquatic center but unfolds into a powerful story of a mother’s dementia and her daughter’s love\" (The Washington Post). The swimmers are unknown to one another except through their private routines (slow lane, medium lane, fast lane) and the solace each takes in their morning or afternoon laps. But when a crack appears at the bottom of the pool, they are cast out into an unforgiving world without comfort or relief. One of these swimmers is Alice, who is slowly losing her memory. For Alice, the pool was a final stand against the darkness of her encroaching dementia. Without the fellowship of other swimmers and the routine of her daily laps she is plunged into dislocation and chaos, swept into memories of her childhood and the Japanese American incarceration camp in which she spent the war. Alice's estranged daughter, reentering her mother's life too late, witnesses her stark and devastating decline.",
        "coverurl": "https://books.google.com/books/content?id=fnSTEAAAQBAJ&printsec=frontcover&img=1&zoom=10&source=gbs_api"
    },
    {
        "mmsId": "9952356751401401",
        "isbn": "9781889471181",
        "title": "Anthology Of Essays On Deep Listening",
        "author": "",
        "recStatus": "Yes",
        "recDate": "2023-10-20",
        "callNo": "Unknown",
        "summary": "In this ground-breaking work, twenty-three authors investigate and discuss composer Pauline Oliveros' revolutionary practice of Deep Listening. From an education program reaching 47,000 San Francisco school children to electronic dance music (EDM) events held in remote desert locations, from underwater duets with whales to architectural listening, the multifaceted essays in this collection provide compelling depictions of Deep Listening's ability to nurture creative work and promote societal change.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781889471181-L.jpg"
    },
    {
        "mmsId": "9952375948501401",
        "isbn": "9781598536737",
        "title": "Plymouth Colony : Narratives Of English Settlement And Native Resistance From The Mayflower To King Philip's War /",
        "author": "",
        "recStatus": "Yes",
        "recDate": "2023-10-20",
        "callNo": "973.2",
        "summary": "Four centuries after the Mayflower's arrival, a landmark collection of firsthand accounts charting the history of the English newcomers and their fateful encounters with the region's Native peoples For centuries the story of the Pilgrims and the Mayflower has been told and retold--the landing at Plymouth Rock and the first Thanksgiving, and the decades that followed, as the colonists struggled to build an enduring and righteous community in the New World wilderness. But the place where the Plymouth colonists settled was no wilderness: it was Patuxet, in the ancestral homeland of the Wampanoag people, a long-inhabited region of fruitful and sustainable agriculture and well-traveled trade routes, a civilization with deep historical memories and cultural traditions. And while many Americans have sought comfort in the reassuring story of peaceful cross-cultural relations embodied in the myth of the first Thanksgiving, far fewer are aware of the complex history of diplomacy, exchange, and conflict between the Plymouth colonists and Native peoples. Now, Plymouth Colony brings together for the first time fascinating first-hand narratives written by English settlers--Mourt's Relation, the classic account of the colony's first year; Governor William Bradford's masterful Of Plimouth Plantation; Edward Winslow's Good News from New England; the heterodox Thomas Morton's irreverent challenge to Puritanism, New English Canaan; and Mary Rowlandson's landmark \"captivity narrative\" The Sovereignty and Goodness of God--with a selection of carefully chosen documents (deeds, patents, letters, speeches) that illuminate the intricacies of Anglo-Native encounters, the complex role of Christian Indians, and the legacy of Massasoit, Weetamoo, Metacom (\"King Philip\"), and other Wampanoag leaders who faced the ongoing incursion into their lands of settlers from across the sea. The interactions of Plymouth Colony and the Wampanoag culminated in the horrors of King Philip's War, a conflict that may have killed seven percent of the total population, Anglo and Native, of New England. While the war led to the end of Plymouth's existence as a separate colony in 1692, it did not extinguish the Wampanoag people, who still live in their ancestral homeland in the twenty-first century.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781598536737-L.jpg"
    },
    {
        "mmsId": "9952375949301401",
        "isbn": "9781598537246",
        "title": "The Woman Warrior ; China Men ; Tripmaster Monkey ; HawaiʻI One Summer ; Other Writings /",
        "author": "Kingston, Maxine Hong, Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-18",
        "callNo": "973/.04951",
        "summary": "The largest and most comprehensive edition of our foremost Asian American writer: three classic books and additional writings, many rare, that together offer a vivid and searching portrait of immigrant experience and American dreams. Maxine Hong Kingston made a stunning entrance on the American literary scene with The Woman Warrior (1976), her “memoirs of a childhood among ghosts.\" Not only an account of growing up poor and Chinese American in the San Joaquin Valley, it was also an audacious feat of imaginative transformation and pathbreaking work of feminist autobiography, drawing on ancient myths and the family stories her mother brought over from China to make sense of a transformed life in America. A companion to The Woman Warrior, which she called her “mother-book,” Kingston’s “father-book” China Men (1980) spreads out across a large geographical and historical canvas to envision the lives of her male relatives who immigrated to America. Taken together, The Woman Warrior and China Men offer a profound, kaleidoscopic, genre-defying narrative of the American experience. Kingston's third book, Tripmaster Monkey: His Fake Book (1989), is the wildly inventive story of Wittman Ah Sing, a Berkeley graduate student whose experience of the San Francisco Beat scene transforms his understanding of his own Chinese heritage. Rounding out the volume are a series of essays from 1978 reflecting on her life in Hawaii, later collected as Hawai‘i One Summer, personal musings whose subjects range from the contentions of a conference of Asian American writers to home-buying, surfing, and the work of the Beat poet Lew Welch. Also included are hard-to-find essays about the creative process and Kingston’s exasperated, insightful account of how most of the reviewers of The Woman Warrior fell prey to lazy stereotypes about the “exotic” and “inscrutable” East.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781598537246-L.jpg"
    },
    {
        "mmsId": "9952375949401401",
        "isbn": "9781598537253",
        "title": "The Army Of The Potomac Trilogy /",
        "author": "Catton, Bruce, 1899-1978, Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-18",
        "callNo": "973.7/3",
        "summary": "Library of America restores to print a masterpiece of Civil War history in a deluxe collector’s edition Bruce Catton's Army of the Potomac trilogy is a landmark of historical story-telling, one of the most popular and influential works ever written about the Civil War. And yet for decades it has been unavailable in full. Now, Library of America restores the entirety of this essential classic to print in a deluxe, single-volume collector's edition, with full-color endpaper maps, and detailed notes and a newly-researched chronology of Catton's life and career by acclaimed Civil War scholar Gary W. Gallagher. Mr. Lincoln's Army, the first book in the trilogy, describes the Army of the Potomac's formation as the bulwark of the Union war effort as emerging friction between the army's commanding general George McClellan and the Commander in Chief in Washington reaches a crisis in the wake of the deadly battle at Antietam. Glory Road recounts the critical months between the autumn of 1862 and midsummer 1863, including the battles at Fredericksburg, Rappahannock and Chancellorsville which set the state for the costly Union victory as Gettysburg. Catton's retelling of the story of Lincoln's address at Gettysburg remains unrivalled. In A Stillness of Appomattox, which won both Pulitzer Prize and the National Book Award, the Army of the Potomac, now under the driving command of Ulyssess S. Grant, finally gains the upper hand against Robert E. Lee, culminating in one of the most vividly drawn accounts of Lee's final surrender.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781598537253-L.jpg"
    },
    {
        "mmsId": "9952375949801401",
        "isbn": "9781598537192",
        "title": "Charlotte Perkins Gilman : Novels, Stories & Poems : The Yellow Wallpaper ; Herland ; With Her In Ourland ; Selected Stories And Poems /",
        "author": "Gilman, Charlotte Perkins, 1860-1935, Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-18",
        "callNo": "818.409",
        "summary": "A definitive edition of the groundbreaking feminist fiction of a nineteenth century pioneer Library of America presents the fullest selection ever of visionary American writer Charlotte Perkins Gilman: two novels, forty-four brilliant short stories, nearly two-hundred poems, and both the published and manuscript versions of the landmark story “The Yellow Wall-Paper.” The short fiction presented here showcases Gilman’s mastery of ghost stories, allegorical fantasy, and social realism and includes a virtuoso series of stories written in imitation of the most acclaimed authors of her day. The utopian novels Herland and With Her in Ourland—about a remote and isolated society of women—are pioneering works of speculative fiction and still-incisive commentaries on the politics of gender. Gilman was known to her contemporaries first and foremost as a poet, and this volume brings together her collection In This Our World with more than fifty other poems, many written in support of suffrage and other causes.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781598537192-L.jpg"
    },
    {
        "mmsId": "9952376052801401",
        "isbn": "9781324036661",
        "title": "Against Technoableism: Rethinking Who Needs Improvement.",
        "author": "Shew, Ashley, 1983-",
        "recStatus": "Yes",
        "recDate": "2023-10-16",
        "callNo": "Unknown",
        "summary": "A manifesto exploding what we think we know about disability, and arguing that disabled people are the real experts when it comes to technology and disability.",
        "coverurl": "https://books.google.com/books/content?id=J0SczwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api"
    },
    {
        "mmsId": "9952356751001401",
        "isbn": "9781984859525",
        "title": "Project 562 : Changing The Way We See Native America /",
        "author": "Wilbur, Matika, Author, Photographer.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "970.00497 W666 2023",
        "summary": "A photographic and narrative celebration of contemporary Native American life and cultures, alongside an in-depth examination of issues that Native people face, by celebrated photographer and storyteller Matika Wilbur of the Swinomish and Tulalip Tribes. In 2012, Matika Wilbur sold everything in her Seattle apartment and set out on a Kickstarter-funded pursuit to visit, engage, and photograph people from what were then 562 federally recognized Native American Tribal Nations. Over the next decade, she traveled six hundred thousand miles across fifty states—from Seminole country (now known as the Everglades) to Inuit territory (now known as the Bering Sea)—to meet, interview, and photograph hundreds of Indigenous people. The body of work Wilbur created serves to counteract the one-dimensional and archaic stereotypes of Native people in mainstream media and offers justice to the richness, diversity, and lived experiences of Indian Country. The culmination of this decade-long art and storytelling endeavor, Project 562 is a peerless, sweeping, and moving love letter to Indigenous Americans, containing hundreds of stunning portraits and compelling personal narratives of contemporary Native people—all photographed in clothing, poses, and locations of their choosing. Their narratives touch on personal and cultural identity as well as issues of media representation, sovereignty, faith, family, the protection of sacred sites, subsistence living, traditional knowledge-keeping, land stewardship, language preservation, advocacy, education, the arts, and more. A vital contribution from an incomparable artist, Project 562 inspires, educates, and truly changes the way we see Native America.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781984859525-L.jpg"
    },
    {
        "mmsId": "9952356751301401",
        "isbn": "9780674258549",
        "title": "The College Administrator's Survival Guide /",
        "author": "Gunsalus, C. K., Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "378.11 G9767 2021",
        "summary": "The book that every dean and department chair needs to survive--and thrive--in the twenty-first-century university. First released in 2006, The College Administrator's Survival Guide has served as the bible for a generation of provosts, deans, department chairs, and program directors. Shrewd administrators have returned to the guide time and again for C. K. Gunsalus's advice on handling complaints, negotiating disagreements, and dealing with difficult personalities. Now, in this revised and updated edition, Gunsalus guides rookie administrators and seasoned veterans through today's most pressing higher-education challenges. These days academic leaders must respond to heightened demands for transparency and openness. These demands are intensified by social media, which increases the visibility of university conflicts and can foster widespread misinformation about campus affairs. Meanwhile, institutions have become flatter, with administrators expected to work more closely with faculty, students, and a range of professionals even as support staffs shrink. Between the ever-replenishing inbox, the integration of often-exasperating management systems into every dimension of academic life, and the new demands of remote learning, deans and department heads are juggling more balls than ever before. Tightening budgets have already forced administrators into more difficult choices and, in the wake of COVID-19, there will be no relief from financial constraints. From #MeToo to partisan battles over curricula and funding, college and university leaders need more savvy and greater sensitivity than ever. What hasn't changed are the challenges of dealing with difficult people and the importance of creating and maintaining environments in which faculty, staff, and students have the support they need to do their best work. The College Administrator's Survival Guide provides the tools to keep cool and get the job done.",
        "coverurl": "https://books.google.com/books/content?id=13YrEAAAQBAJ&printsec=frontcover&img=1&zoom=10&source=gbs_api"
    },
    {
        "mmsId": "9952356751501401",
        "isbn": "9780593489727",
        "title": "Real Self-Care : A Transformative Program For Redefining Wellness (Crystals, Cleanses, And Bubble Baths Not Included) /",
        "author": "Lakshmin, Pooja, Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "613 L1929 2023",
        "summary": "From women’s mental health specialist and New York Times contributor Pooja Lakshmin, MD, comes a long-overdue reckoning with the contradictions of the wellness industry and a paradigm-shifting program for practicing real self-care that will empower, uplift, and maybe even start a revolution. You may have noticed that it’s nearly impossible to go even a couple days without coming across the term self-care. A word that encompasses any number of lifestyle choices and products—from juice cleanses to yoga workshops to luxury bamboo sheets—self-care has exploded in our collective consciousness as a panacea for practically all of women’s problems. Board-certified psychiatrist Dr. Pooja Lakshmin finds this cultural embrace of self-care incomplete at best and manipulative at worst. Fixing your troubles isn’t simple as buying a new day planner or signing up for a meditation class. These faux self-care practices keep us looking outward—comparing ourselves with others or striving for a certain type of perfection. Even worse, they exonerate an oppressive social system that has betrayed women and minorities. Real self-care, in contrast, is an internal, self-reflective process that involves making difficult decisions in line with our values, and when we practice it, we shift our relationships, our workplaces, and even our broken systems. In Real Self-Care, Lakshmin helps readers understand what a real practice of caring for yourself could—and does—look like. Using case studies from her practice, clinical research, and the down-to-earth style that she's become known for, Lakshmin provides a step-by-step program for real and sustainable change and solace. Packed with actionable strategies to deal with common problems, Real Self-Care is a complete roadmap for women to set boundaries and move past guilt, treat themselves with compassion, get closer to themselves, and assert their power. The result—having ownership over one’s own life— is nothing less than a personal and social revolution.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780593489727-L.jpg"
    },
    {
        "mmsId": "9952356852201401",
        "isbn": "9780593420324",
        "title": "Trust /",
        "author": "DíAz, HernáN, 1973- Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Fiction D5424t 2022",
        "summary": "WINNER OF THE PULITZER PRIZE FOR FICTION A NEW YORK TIMES BESTSELLER ONE OF THE NEW YORK TIMES TOP TEN BOOKS OF 2022 ONE OF BARACK OBAMA'S FAVORITE BOOKS OF 2022 LONGLISTED FOR THE 2022 BOOKER PRIZE “Buzzy and enthralling …A glorious novel about empires and erasures, husbands and wives, staggering fortunes and unspeakable misery…Fun as hell to read.” —Oprah Daily \"A genre-bending, time-skipping story about New York City’s elite in the roaring ’20s and Great Depression.\"—Vanity Fair “A riveting story of class, capitalism, and greed.” —Esquire \"Exhilarating.” —New York Times Even through the roar and effervescence of the 1920s, everyone in New York has heard of Benjamin and Helen Rask. He is a legendary Wall Street tycoon; she is the daughter of eccentric aristocrats. Together, they have risen to the very top of a world of seemingly endless wealth—all as a decade of excess and speculation draws to an end. But at what cost have they acquired their immense fortune? This is the mystery at the center of Bonds, a successful 1937 novel that all of New York seems to have read. Yet there are other versions of this tale of privilege and deceit. Hernan Diaz’s TRUST elegantly puts these competing narratives into conversation with one another—and in tension with the perspective of one woman bent on disentangling fact from fiction. The result is a novel that spans over a century and becomes more exhilarating with each new revelation. At once an immersive story and a brilliant literary puzzle, TRUST engages the reader in a quest for the truth while confronting the deceptions that often live at the heart of personal relationships, the reality-warping force of capital, and the ease with which power can manipulate facts.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780593420324-L.jpg"
    },
    {
        "mmsId": "9952369249601401",
        "isbn": "9781541674806",
        "title": "Sexed Up : How Society Sexualizes Us, And How We Can Fight Back /",
        "author": "Serano, Julia, Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "306.70973 S481 2022",
        "summary": "The author of landmark manifesto Whipping Girl exposes the violent ways we are all sexualized-then offers a bold path for resistance Feminists have long challenged the ways in which men tend to sexualize women. But pioneering activist, biologist, and trans woman Julia Serano argues that sexualization is a far more pervasive problem, as it's something that we all do to other people, often without being aware of it. Why do we perceive men as sexual predators and women as sexual objects? Why are LGBTQ+ people stereotyped as being sexually indiscriminate and deceptive? Why are people of color still being hypersexualized? These stereotypes push minorities farther into the margins, and even the privileged are policed from transgressing, lest they also become targets. Many view sexualization as a mere component of sexism, racism, or queerphobia, but Serano argues that liberation from sexual violence comes through collectively confronting sexualization itself.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781541674806-L.jpg"
    },
    {
        "mmsId": "9952369249701401",
        "isbn": "9781770465619",
        "title": "Movements And Moments /",
        "author": "",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "305.42 M9352 2022",
        "summary": "An ambitious feminist anthology chronicling Indigenous rebellions around the world In 1930s Bolivia, self-described Anarchist Cholas form a libertarian trade union. In the Northern Highlands of Vietnam, the songs of one girl’s youth lead her to a life of activism. In the Philippines, female elders from Kalinga blaze a trail when pushed into impromptu protest. Equally striking accounts from Brazil, Chile, Ecuador, India, Nepal, Peru and Thailand weave a tapestry of trauma and triumph, shedding light on not-too-distant histories otherwise overlooked. Indigenous Peoples all over the world have always had to stand their ground in the face of colonialism. While the details may differ, what these stories have in common is their commitment to resistance in a world that puts profit before respect, and western notions of progress before their own. Movements and Moments is an introductory glimpse into how Indegenous Peoples tell these stories in their own words. From Southeast Asia to South America, vibrant communities must grapple with colonial realities to assert ownership over their lands and traditions. This project was undertaken in cooperation with the Goethe-Institut Indonesien in Jakarta. These stories were selected from an open call across 42 countries to spotlight feminist movements and advocacies in the Global South.",
        "coverurl": "https://books.google.com/books/content?id=nR1YEAAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api"
    },
    {
        "mmsId": "9952369249801401",
        "isbn": "9780063013759",
        "title": "The Light Of Days : The Untold Story Of Women Resistance Fighters In Hitler's Ghettos /",
        "author": "Batalion, Judith, Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "940.53183 B3282 2020",
        "summary": "One of the most important stories of World War II, already optioned by Steven Spielberg for a major motion picture: a spectacular, searing history that brings to light the extraordinary accomplishments of brave Jewish women who became resistance fighters--a group of unknown heroes whose exploits have never been chronicled in full, until now. Witnesses to the brutal murder of their families and neighbors and the violent destruction of their communities, a cadre of Jewish women in Poland--some still in their teens--helped transform the Jewish youth groups into resistance cells to fight the Nazis. With courage, guile, and nerves of steel, these \"ghetto girls\" paid off Gestapo guards, hid revolvers in loaves of bread and jars of marmalade, and helped build systems of underground bunkers. They flirted with German soldiers, bribed them with wine, whiskey, and home cooking, used their Aryan looks to seduce them, and shot and killed them. They bombed German train lines and blew up a town's water supply. They also nursed the sick and taught children. Yet the exploits of these courageous resistance fighters have remained virtually unknown. As propulsive and thrilling as Hidden Figures, In the Garden of Beasts, Band of Brothers, and A Train in Winter, The Light of Days at last tells the true story of these incredible women whose courageous yet little-known feats have been eclipsed by time. Judy Batalion--the granddaughter of Polish Holocaust survivors--takes us back to 1939 and introduces us to Renia Kukielka, a weapons smuggler and messenger who risked death traveling across occupied Poland on foot and by train. Joining Renia are other women who served as couriers, armed fighters, intelligence agents, and saboteurs, all who put their lives in mortal danger to carry out their missions. Batalion follows these women through the savage destruction of the ghettos, arrest and internment in Gestapo prisons and concentration camps, and for a lucky few--like Renia, who orchestrated her own audacious escape from a brutal Nazi jail--into the late 20th century and beyond. Powerful and inspiring, featuring twenty black-and-white photographs, The Light of Days is an unforgettable true tale of war, the fight for freedom, exceptional bravery, female friendship, and survival in the face of staggering odds.",
        "coverurl": "https://books.google.com/books/content?id=4VPzygEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api"
    },
    {
        "mmsId": "9952369249901401",
        "isbn": "9780593490617",
        "title": "His Name Is George Floyd : One Man's Life And The Struggle For Racial Justice /",
        "author": "Samuels, Robert, 1984- Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "305.896 S1938 2022",
        "summary": "WINNER OF THE 2023 PULITZER PRIZE IN NONFICTION FINALIST FOR THE NATIONAL BOOK AWARD AND LOS ANGELES TIMES BOOK PRIZE; FINALIST FOR THE J. ANTHONY LUKAS PRIZE; A BCALA 2023 HONOR NONFICTION AWARD WINNER. A landmark biography by two prizewinning Washington Post reporters that reveals how systemic racism shaped George Floyd's life and legacy—from his family’s roots in the tobacco fields of North Carolina, to ongoing inequality in housing, education, health care, criminal justice, and policing—telling the story of how one man’s tragic experience brought about a global movement for change. “It is a testament to the power of His Name Is George Floyd that the book’s most vital moments come not after Floyd’s death, but in its intimate, unvarnished and scrupulous account of his life . . . Impressive.” —New York Times Book Review (Editors' Choice) “Since we know George Floyd’s death with tragic clarity, we must know Floyd’s America—and life—with tragic clarity. Essential for our times.” —Ibram X. Kendi, author of How to Be an Antiracist “A much-needed portrait of the life, times, and martyrdom of George Floyd, a chronicle of the racial awakening sparked by his brutal and untimely death, and an essential work of history I hope everyone will read.” —Henry Louis Gates, Jr., author of The Black Church: This Is Our Story, This Is Our Song The events of that day are now tragically familiar: on May 25, 2020, George Floyd became the latest Black person to die at the hands of the police, murdered outside of a Minneapolis convenience store by white officer Derek Chauvin. The video recording of his death set off the largest protest movement in the history of the United States, awakening millions to the pervasiveness of racial injustice. But long before his face was painted onto countless murals and his name became synonymous with civil rights, Floyd was a father, partner, athlete, and friend who constantly strove for a better life. His Name Is George Floyd tells the story of a beloved figure from Houston's housing projects as he faced the stifling systemic pressures that come with being a Black man in America. Placing his narrative within the context of the country's enduring legacy of institutional racism, this deeply reported account examines Floyd's family roots in slavery and sharecropping, the segregation of his schools, the overpolicing of his community amid a wave of mass incarceration, and the callous disregard toward his struggle with addiction—putting today's inequality into uniquely human terms. Drawing upon hundreds of interviews with Floyd's closest friends and family, his elementary school teachers and varsity coaches, civil rights icons, and those in the highest seats of political power, Washington Post reporters Robert Samuels and Toluse Olorunnipa offer a poignant and moving exploration of George Floyd’s America, revealing how a man who simply wanted to breathe ended up touching the world.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780593490617-L.jpg"
    },
    {
        "mmsId": "9952369250001401",
        "isbn": "9780415952514",
        "title": "Beyond Resistance! : Youth Activism And Community Change : New Democratic Possibilities For Practice And Policy For America's Youth /",
        "author": "",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "362.7083 B5737 2006",
        "summary": "First Published in 2006. Routledge is an imprint of Taylor & Francis, an informa company.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780415952514-L.jpg"
    },
    {
        "mmsId": "9952369250101401",
        "isbn": "9781459833913",
        "title": "Waking Ben Doldrums /",
        "author": "Smith, Heather, 1968- Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Picture S6494w 2023",
        "summary": "Neighbors come together to support a university student experiencing depression in this illustrated picture book about the power of community and kindness.",
        "coverurl": "https://books.google.com/books/content?id=HadCzwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api"
    },
    {
        "mmsId": "9952369250201401",
        "isbn": "9781771644341",
        "title": "Can You Hear The Trees Talking?: Discovering The Hidden Life Of The Forest.",
        "author": "Wohlleben, Peter, 1964-",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Unknown",
        "summary": "A walk in the park will never be the same after kids discover this awe-inspiring book. Meet Peter Wohlleben--but you can call him Peter the Forester! With his groundbreaking, internationally bestselling book The Hidden Life of Trees, Peter Wohlleben established himself as a global advocate for forests and our relationship with trees. Now, Peter shares his famous imagination and storytelling style with children, asking surprising questions about trees with exciting quizzes, photographs, and hands-on activities to help even the most reluctant learners discover the answers. Did you know that trees have parents, and tree grandparents with wrinkles? That tree kids go to school for hundreds of years? That there is such a thing as the forest internet? And that trees make us healthy and strong. Sometimes, even trees get sick, but we can help them heal. Can You Hear the Trees Talking? shares the mysteries and magic of the forest in language kids will love and understand.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781771644341-L.jpg"
    },
    {
        "mmsId": "9952369250301401",
        "isbn": "9780316056618",
        "title": "Freewater.",
        "author": "Luqman-Dawson, Amina",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Unknown",
        "summary": "After fleeing the plantation where they were enslaved, siblings Ada and Homer discover the secret community of Freewater, and work with freeborn Sanzi to protect their new home from the encroaching dangers of the outside world.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780316056618-L.jpg"
    },
    {
        "mmsId": "9952369250401401",
        "isbn": "9780525511335",
        "title": "Woman Of Light : A Novel",
        "author": "Fajardo-Anstine, Kali.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Fiction F175w 2023",
        "summary": "NATIONAL BESTSELLER • A “dazzling, cinematic, intimate, lyrical” (Roxane Gay) epic of betrayal, love, and fate that spans five generations of an Indigenous Chicano family in the American West, from the author of the National Book Award finalist Sabrina & Corina “Sometimes you just step into a book and let it wash over you, like you’re swimming under a big, sparkling night sky.”—Celeste Ng, author of Little Fires Everywhere and Everything I Never Told You A PHENOMENAL BOOK CLUB PICK AND AN AUDACIOUS BOOK CLUB PICK • ONE OF THE BEST BOOKS OF THE YEAR: Book Riot There is one every generation, a seer who keeps the stories. Luz “Little Light” Lopez, a tea leaf reader and laundress, is left to fend for herself after her older brother, Diego, a snake charmer and factory worker, is run out of town by a violent white mob. As Luz navigates 1930s Denver, she begins to have visions that transport her to her Indigenous homeland in the nearby Lost Territory. Luz recollects her ancestors’ origins, how her family flourished, and how they were threatened. She bears witness to the sinister forces that have devastated her people and their homelands for generations. In the end, it is up to Luz to save her family stories from disappearing into oblivion. Written in Kali Fajardo-Anstine’s singular voice, the wildly entertaining and complex lives of the Lopez family fill the pages of this multigenerational western saga. Woman of Light is a transfixing novel about survival, family secrets, and love—filled with an unforgettable cast of characters, all of whom are just as special, memorable, and complicated as our beloved heroine, Luz. LONGLISTED FOR THE JOYCE CAROL OATES PRIZE • LONGLISTED FOR THE CAROL SHIELDS PRIZE FOR FICTION",
        "coverurl": "https://books.google.com/books/content?id=YC2cEAAAQBAJ&printsec=frontcover&img=1&zoom=10&source=gbs_api"
    },
    {
        "mmsId": "9952369250501401",
        "isbn": "9780063038233",
        "title": "Rust In The Root /",
        "author": "Ireland, Justina, Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Fiction I657r 2022",
        "summary": "The author of the visionary New York Times bestseller Dread Nation returns with another spellbinding historical fantasy set at the crossroads of race and power in America. It is 1937, and Laura Ann Langston lives in an America divided--between those who work the mystical arts and those who do not. Ever since the Great Rust, a catastrophic event that blighted the arcane force called the Dynamism and threw America into disarray, the country has been rebuilding for a better future. And everyone knows the future is industry and technology--otherwise known as Mechomancy--not the traditional mystical arts. Laura disagrees. A talented young queer mage from Pennsylvania, Laura hopped a portal to New York City on her seventeenth birthday with hopes of earning her mage's license and becoming something more than a rootworker. But four months later, she's got little to show for it other than an empty pocket and broken dreams. With nowhere else to turn, Laura applies for a job with the Bureau of the Arcane's Conservation Corps, a branch of the US government dedicated to repairing the Dynamism so that Mechomancy can thrive. There she meets the Skylark, a powerful mage with a mysterious past, who reluctantly takes Laura on as an apprentice. As they're sent off on their first mission together into the heart of the country's oldest and most mysterious Blight, they discover the work of mages not encountered since the darkest period in America's past, when Black mages were killed for their power--work that could threaten Laura's and the Skylark's lives, and everything they've worked for.",
        "coverurl": "https://books.google.com/books/content?id=rkqSzwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api"
    },
    {
        "mmsId": "9952369250601401",
        "isbn": "9781250834782",
        "title": "Roses, In The Mouth Of A Lion.",
        "author": "Rehman, Bushra",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Unknown",
        "summary": "\"In the vein of Dominicana and My Brilliant Friend, an unforgettable story about female friendship and queer love in a Pakistani-American community Razia Mirza grows up amid the wild grape vines and backyard sunflowers of Corona, Queens, with her best friend, Saima, by her side. But when a family rift drives the girls apart, Razia's idyllic childhood is shattered forever. In middle school, Razia befriends a new girl, Taslima, and they begin to chafe at the restrictions imposed on them in their tight-knit Pakistani Muslim community. Together, they embark on a series of small rebellions: listening to scandalous American music, wearing mini skirts, and cutting school to explore the city. Then Razia is accepted to a prestigious high school in Manhattan and the gulf between the person she wants to be and the daughter her parents expect widens. There, she meets beautiful, free-spirited Angela, Razia is attracted to her in a way that first confuses her and then blossoms into new understanding. But when their relationship is discovered by an Aunty in the community, Razia must choose between her family and her own future. Punctuated by both joy and loss, full '80s music and beloved novels, Roses, in the Mouth of a Lion is a new classic: a fiercely compassionate coming-of-age story of a girl struggling to reconcile her own heritage and faith with her desire to be true to herself\"--",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781250834782-L.jpg"
    },
    {
        "mmsId": "9952369250701401",
        "isbn": "9781668000533",
        "title": "Moby Dyke : An Obsessive Quest To Track Down The Last Remaining Lesbian Bars In America /",
        "author": "Burton, Krista, Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "306.7663 B9745 2023",
        "summary": "A former Rookie contributor and creator of the popular blog Effing Dykes investigates the disappearance of America’s lesbian bars by visiting the last few in existence. Lesbian bars have always been treasured safe spaces for their customers, providing not only a good time but a shelter from societal alienation and outright persecution. In 1987, there were 206 of them in America. Today, only a couple dozen remain. How and why did this happen? What has been lost—or possibly gained—by such a decline? What transpires when marginalized communities become more accepted and mainstream? In Moby Dyke, Krista Burton attempts to answer these questions firsthand, venturing on an epic cross-country pilgrimage to the last few remaining dyke bars. Her pilgrimage includes taking in her first drag show since the onset of the pandemic at The Back Door in Bloomington, Indiana; competing in dildo races at Houston’s Pearl Bar; and, despite her deep-seated hatred of karaoke, joining a group serenade at Nashville’s Lipstick Lounge and enjoying the dreaded pastime for the first time in her life. While Burton sets out on the excursion to assess the current state of lesbian bars, she also winds up examining her own personal journey, from coming out to her Mormon parents to recently marrying her husband, a trans man whose presence on the trip underscores the important conversation about who precisely is welcome in certain queer spaces—and how they and their occupants continue to evolve. Moby Dyke is an insightful and hilarious travelogue that celebrates the kind of community that can only be found in windowless rooms soundtracked by Britney Spears-heavy playlists and illuminated by overhead holiday lights no matter the time of year.",
        "coverurl": "https://books.google.com/books/content?id=Ke29EAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api"
    },
    {
        "mmsId": "9952369250801401",
        "isbn": "9780593489635",
        "title": "How To Read Now: Essays.",
        "author": "Castillo, Elaine,",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Unknown",
        "summary": "“How to Read Now explores the politics and ethics of reading, and insists that we are capable of something better: a more engaged relationship not just with our fiction and our art, but with our buried and entangled histories.” “A book that doesn’t seek to shut down the current literary discourse so much as shake it up.” (The New York Times Book Review) Offering “its audience the opportunity to look past the simplicity we’re all too often spoon-fed into order to restore ourselves to chaos and complexity — a way of seeing and reading that demands so much more of us but offers even more in return.\" (Los Angeles Times) \"I gasped, shouted, and holler-laughed while reading these essays from the phenomenal Elaine Castillo. What powerful writing, what a rigorous mind. For as long as I live, I want to read anything Castillo writes, and you probably do, too.\" —R.O. Kwon, author of The Incendiaries How many times have we heard that reading builds empathy? That we can travel through books? How often have we were heard about the importance of diversifying our bookshelves? Or claimed that books saved our lives? These familiar words—beautiful, aspirational—are sometimes even true. But award-winning novelist Elaine Castillo has more ambitious hopes for our reading culture, and in this collection of linked essays, “she moves to wrest reading away from the cotton-candy aspirations of uniting people in empathetic harmony and reposition it as thornier, ultimately more rewarding work.” (Vulture) How to Read Now explores the politics and ethics of reading, and insists that we are capable of something better: a more engaged relationship not just with our fiction and our art, but with our buried and entangled histories. Smart, funny, galvanizing, and sometimes profane, Castillo attacks the stale questions and less-than-critical proclamations that masquerade as vital discussion: reimagining the cartography of the classics, building a moral case against the settler colonialism of lauded writers like Joan Didion, taking aim at Nobel Prize winners and toppling indie filmmakers, and celebrating glorious moments in everything from popular TV like The Watchmen to the films of Wong Kar-wai and the work of contemporary poets like Tommy Pico. At once a deeply personal and searching history of one woman’s reading life, and a wide-ranging and urgent intervention into our globalized conversations about why reading matters today, How to Read Now empowers us to embrace a more complicated, embodied form of reading, inviting us to acknowledge complicated truths, ignite surprising connections, imagine a more daring solidarity, and create space for a riskier intimacy—within ourselves, and with each other.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780593489635-L.jpg"
    },
    {
        "mmsId": "9952369250901401",
        "isbn": "9781668016138",
        "title": "Holly: A Novel.",
        "author": "King, Stephen, 1947-",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Unknown",
        "summary": "\"Stephen King's HOLLY marks the triumphant return of beloved King character Holly Gibney. Readers have witnessed Holly's gradual transformation from a shy and reclusive (but also brave and ethical) homebody in Mr. Mercedes to Bill Hodges's partner in Finders Keepers and End of Watch to a full-fledged, smart and occasionally tough private detective on her own in The Outsider and If It Bleeds. In this new novel, Holly once again claims the spotlight, and must face some of her most depraved adversaries yet. When Penny Dahl calls the Finders Keepers detective agency hoping for help locating her missing daughter, Holly is reluctant to accept the case. Her own mother has just died, and Holly is supposed to be taking time off. But something in Penny Dahl's desperate voice makes it impossible for Holly to turn her down. Mere blocks from where Bonnie Dahl disappeared live Professors Rodney and Emily Harris. They are the picture of bourgeois respectability: married octogenarians, devoted to each other, semi-retired lifelong academics. But they are harboring an unholy secret in their well-kept, book-lined home, one that may be related to Bonnie's disappearance. And it will prove nearly impossible to discover what they are up to: they are smart, they are patient, and they are ruthless. Holly must summon all her formidable talents to outhink and outmaneuver this brilliant and twisted pair in this chilling new masterwork from Stephen King\"--",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781668016138-L.jpg"
    },
    {
        "mmsId": "9952369251001401",
        "isbn": "9781639731169",
        "title": "Every Drop Is A Man's Nightmare : Stories /",
        "author": "Kakimoto, Megan Kamalei, Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Fiction K139e 2023",
        "summary": "From major new storytelling talent Megan Kamalei Kakimoto, a blazing, bodily, raucous journey through contemporary Hawaiian identity and womanhood. \"A knockout. Eleven knockouts, one KO for every story.\"—Elizabeth McCracken",
        "coverurl": "https://books.google.com/books/content?id=_xChEAAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api"
    },
    {
        "mmsId": "9952369251101401",
        "isbn": "9781684158324",
        "title": "Eat The Rich /",
        "author": "Gailey, Sarah, Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Fiction G138e 2022",
        "summary": "When the rich and powerful are literal cannibals, how can regular people avoid being on the menu? WELCOME TO CRESTFALL BLUFFS! With law school and her whole life ahead of her, Joey plans to spend the summer with her boyfriend Astor at his seemingly perfect family home. But beneath all the affluent perfection lies a dark, deadly rot… something all the locals live in quiet fear of. As summer lingers, Joey uncovers the macabre history of Crestfall Bluffs, and the ruthlessness and secrecy lying in wait behind the idyllic lives of the one percent. Who can Joey save? Who wants to be saved? And can she even survive to tell the tale? The bold, horrifying psychological thriller from Hugo Award-winning author Sarah Gailey (The Echo Wife, Magic For Liars) and artist Pius Bak (Firefly, The Magicians) with colorist Roman Titov and letterer Cardinal Rae. Collects Eat the Rich #1-5.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781684158324-L.jpg"
    },
    {
        "mmsId": "9952369251201401",
        "isbn": "9781551528793",
        "title": "Buffalo Is The New Buffalo : Stories /",
        "author": "Vowel, Chelsea, Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Fiction V974b 2022",
        "summary": "Powerful stories of \"Métis futurism\" that envision a world without violence, capitalism, and colonization.",
        "coverurl": "https://books.google.com/books/content?id=e7SNzgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api"
    },
    {
        "mmsId": "9952371352301401",
        "isbn": "9780062969828",
        "title": "The Blade Between : A Novel /",
        "author": "Miller, Sam J., Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Fiction M6511b 2020",
        "summary": "From Nebula Award winner Sam J. Miller comes a frightening and uncanny ghost story about a rapidly changing city in upstate New York and the mysterious forces that threaten it. Ronan Szepessy promised himself he'd never return to Hudson. The sleepy upstate town was no place for a restless gay photographer. But his father is ill and New York City's distractions have become too much for him. He hopes that a quick visit will help him recharge. Ronan reconnects with two friends from high school: Dom, his first love, and Dom's wife, Attalah. The three former misfits mourn what their town has become--overrun by gentrifiers and corporate interests. With friends and neighbors getting evicted en masse and a mayoral election coming up, Ronan and Attalah craft a plan to rattle the newcomers and expose their true motives. But in doing so, they unleash something far more mysterious and uncontainable. Hudson has a rich, proud history and, it turns out, the real-state developers aren't the only forces threatening its well-being: the spirits undergirding this once-thriving industrial town are enraged. Ronan's hijinks have overlapped with a bubbling up of hate and violence among friends and neighbors, and everything is spiraling out of control. Ronan must summon the very best of himself to shed his own demons and save the city he once loathed.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780062969828-L.jpg"
    },
    {
        "mmsId": "9952373352501401",
        "isbn": "9780063056763",
        "title": "Swim Team.",
        "author": "Christmas, Johnnie",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Unknown",
        "summary": "A splashy, contemporary middle grade graphic novel from bestselling comics creator Johnnie Christmas!",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780063056763-L.jpg"
    },
    {
        "mmsId": "9952373352601401",
        "isbn": "9780593310670",
        "title": "Me And The Boss: A Story About Mending And Love.",
        "author": "Edwards, Michelle",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Unknown",
        "summary": "CORETTA SCOTT KING ILLUSTRATOR HONOR AWARD WINNER CHARLOTTE ZOLOTOW AWARD WINNER All the highs and lows of having a bossy, protective, and loving older sibling are depicted in this heartwarming picture book by a critically acclaimed author and award-winning illustrator. Meet Lee, a little boy who won't give up until he learns how to sew, and Zora, the sister who watches him try--and ultimately succeed! \"I know big sisters. Zora, the boss, she's mine,\" explains Lee as he and Zora head to the library, where Mrs. C is teaching the children how to sew. Though Zora sews a beautiful flower on her cloth square, little Lee makes a mess out of the half-moon he is trying to stitch. That night, when he can't sleep, he gives sewing another try...and succeeds, even mending the hole in his pants pocket! The next morning, he sneaks into Zora's room and sews the ear back on Bess, her stuffed bear. When Zora discovers Bess, she wraps Lee in her special big sister hug--for just a moment--and then is back to being the boss once again. National Jewish Book Award-winning author Michelle Edwards and Coretta Scott King-John Steptoe Award-winning illustrator April Harrison create a funny, oh-so-true portrait of a brother and sister’s relationship in this winning picture book.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780593310670-L.jpg"
    },
    {
        "mmsId": "9952373352701401",
        "isbn": "9780593466575",
        "title": "When Women Were Dragons : A Novel /",
        "author": "Barnhill, Kelly Regan, Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Fiction B2623w 2022",
        "summary": "A rollicking feminist tale set in 1950s America where thousands of women have spontaneously transformed into dragons, exploding notions of a woman’s place in the world and expanding minds about accepting others for who they really are. • The first adult novel by the Newbery award-winning author of The Girl Who Drank the Moon Alex Green is a young girl in a world much like ours, except for its most seminal event: the Mass Dragoning of 1955, when hundreds of thousands of ordinary wives and mothers sprouted wings, scales, and talons; left a trail of fiery destruction in their path; and took to the skies. Was it their choice? What will become of those left behind? Why did Alex’s beloved aunt Marla transform but her mother did not? Alex doesn’t know. It’s taboo to speak of. Forced into silence, Alex nevertheless must face the consequences of this astonishing event: a mother more protective than ever; an absentee father; the upsetting insistence that her aunt never even existed; and watching her beloved cousin Bea become dangerously obsessed with the forbidden. In this timely and timeless speculative novel, award-winning author Kelly Barnhill boldly explores rage, memory, and the tyranny of forced limitations. When Women Were Dragons exposes a world that wants to keep women small—their lives and their prospects—and examines what happens when they rise en masse and take up the space they deserve.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780593466575-L.jpg"
    },
    {
        "mmsId": "9952373352801401",
        "isbn": "9781786184702",
        "title": "Saint Death's Daughter /",
        "author": "Cooney, C. S. E. Author. (Claire S. E.),",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Fiction C7757s 2022",
        "summary": "Fun, froofy and glorious: a coming-of-age story in a new trilogy from World Fantasy Award-winning author C.S.E Cooney Life gets complicated when Death gets involved. To be born into a family of royal assassins pretty much guarantees that your life is going to be... rather unusual. Especially if, like Miscellaneous \"Lanie\" Stones, you also have a vicious allergy to all forms of violence and bloodshed, and an uncanny affinity for bringing the dead back to life. To make matters worse, family debt looms – a debt that will have to be paid sooner rather than later if Lanie and her sister are to retain ownership of the ancestral seat, Stones Manor. Lanie finds herself courted and threatened by powerful parties who would love to use her worryingly intimate relationship with the goddess of death for their own nefarious ends. But the goddess has other plans...",
        "coverurl": "https://books.google.com/books/content?id=z7uIzgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api"
    },
    {
        "mmsId": "9952369252101401",
        "isbn": "9780593462294",
        "title": "Mexikid : A Graphic Memoir /",
        "author": "Martin, Pedro, 1967- Author, Artist.",
        "recStatus": "Yes",
        "recDate": "2023-10-03",
        "callNo": "Fiction M3825m 2023",
        "summary": "An unforgettable graphic memoir about a Mexican-American boy’s family and their adventure-filled road trip to bring their abuelito back from Mexico to live with them that National Book Award Finalist Victoria Jamieson calls “one of those books that kids will pass to their friends as soon as they have finished it.” Pedro Martin has grown up hearing stories about his abuelito—his legendary crime-fighting, grandfather who was once a part of the Mexican Revolution! But that doesn't mean Pedro is excited at the news that Abuelito is coming to live with their family. After all, Pedro has 8 brothers and sisters and the house is crowded enough! Still, Pedro piles into the Winnebago with his family for a road trip to Mexico to bring Abuelito home, and what follows is the trip of a lifetime, one filled with laughs and heartache. Along the way, Pedro finally connects with his abuelito and learns what it means to grow up and find his grito.",
        "coverurl": "https://books.google.com/books/content?id=gIqZEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api"
    },
    {
        "mmsId": "9952178876001401",
        "isbn": "9781583225813",
        "title": "Are Prisons Obsolete? /",
        "author": "Davis, Angela Y. 1944- (Angela Yvonne),",
        "recStatus": "Yes",
        "recDate": "2023-10-02",
        "callNo": "365.973 D261a 2003",
        "summary": "With her characteristic brilliance, grace and radical audacity, Angela Y. Davis has put the case for the latest abolition movement in American life: the abolition of the prison. As she quite correctly notes, American life is replete with abolition movements, and when they were engaged in these struggles, their chances of success seemed almost unthinkable. For generations of Americans, the abolition of slavery was sheerest illusion. Similarly,the entrenched system of racial segregation seemed to last forever, and generations lived in the midst of the practice, with few predicting its passage from custom. The brutal, exploitative (dare one say lucrative?) convict-lease system that succeeded formal slavery reaped millions to southern jurisdictions (and untold miseries for tens of thousands of men, and women). Few predicted its passing from the American penal landscape. Davis expertly argues how social movements transformed these social, political and cultural institutions, and made such practices untenable. In Are Prisons Obsolete?, Professor Davis seeks to illustrate that the time for the prison is approaching an end. She argues forthrightly for \"decarceration\", and argues for the transformation of the society as a whole.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781583225813-L.jpg"
    },
    {
        "mmsId": "9952369251501401",
        "isbn": "9780786966639",
        "title": "Player's Handbook.",
        "author": "",
        "recStatus": "Yes",
        "recDate": "2023-10-02",
        "callNo": "793.93 D916p 2014",
        "summary": "No summary.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780786966639-L.jpg"
    },
    {
        "mmsId": "9952369251701401",
        "isbn": "9780786965618",
        "title": "Monster Manual.",
        "author": "",
        "recStatus": "Yes",
        "recDate": "2023-10-02",
        "callNo": "793.93 D916ma 2014",
        "summary": "Fill your Dungeons & Dragons games with deadly monsters from the Monster Manual. The Monster Manual teaches you how to how to fill your Dungeons & Dragons games with monsters—how to populate the game with pesky goblins and mighty dragons for players to battle or beguile, outwit or outrun. Inside the Monster Manual you’ll find more than 150 classic D&D creatures, with vivid illustrations and rich descriptions to help breathe life into your zombies and liches. “…What if I told you about the best book of monsters ever? The 5E Monster Manual just might be the one...”—Ed Grabianowski, io9.Gizmodo.com “D&D acolytes are everywhere...Tech workers from Silicon Valley to Brooklyn have long-running campaigns, and the showrunners and the novelist behind ‘Game of Thrones’ have all been Dungeon Masters.”—Neima Jahromi, The New Yorker • The Monster Manual is one of the three main Dungeons & Dragons books, along with the Player’s Handbook and the Dungeon Master’s Guide. It’s an essential resource for Dungeon Masters to use in populating any type of challenge they might contrive for their players. • From an angel’s wingspan to the vacant eyes of a zombie beholder, the Monster Manual includes more than 150 creatures illustrated in vivid color, with more than 400 quick reference tables to help you bring them to life with ease. • Rich descriptions of each monster help trigger your imagination. From the familiar (“vampires hate sunlight”) to the arcane (“what color is the vapor from a gorgon’s nose?”), the Monster Manual helps inspire your decisions and keep the game flowing smoothly. • In Dungeons & Dragons, you and your friends coauthor your own legend. Guided by a Dungeon Master, you create characters and play their roles in a story, rolling dice and navigating maps as you unfold a tale as limitless as your imagination. • Dungeons & Dragons is the world’s greatest roleplaying game. Created in 1974, D&D transformed gaming culture by blending traditional fantasy with miniatures and wargaming.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780786965618-L.jpg"
    },
    {
        "mmsId": "9952369251801401",
        "isbn": "9781611720778",
        "title": "Just Enough : Lessons From Japan For Sustainable Living, Architecture, And Design /",
        "author": "Brown, Azby, 1956- Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-02",
        "callNo": "333.72095 B8773 2022",
        "summary": "How the mindset of traditional Japanese society can guide our own efforts to lead a green lifestyle today.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781611720778-L.jpg"
    },
    {
        "mmsId": "9952369251901401",
        "isbn": "9780786965625",
        "title": "Dungeon Master's Guide.",
        "author": "",
        "recStatus": "Yes",
        "recDate": "2023-10-02",
        "callNo": "D916d 2014",
        "summary": "Weave legendary stories in the world’s greatest roleplaying game. All you need to run a Dungeons & Dragons game is your imagination, some dice, and this book. The Dungeon Master’s Guide teaches you how to how to run D&D adventures for your players— how to invent monsters for them to fight, mysteries for them to solve, and fantasy worlds for them to explore. “[The Dungeon Master’s Guide is] the one book to rule them all, the most comprehensive and powerful set of resources needed to run a game of D&D. . .” —Charlie Hall, Polygon.com “D&D acolytes are everywhere...Tech workers from Silicon Valley to Brooklyn have long-running campaigns, and the showrunners and the novelist behind ‘Game of Thrones’ have all been Dungeon Masters.”—Neima Jahromi, The New Yorker • The Dungeon Master’s Guide is one of the three main Dungeons & Dragons books, along with the Player’s Handbook and Monster Manual. It’s a reference used by the Dungeon Master (the game’s narrator) to create adventures—to run Dungeons & Dragons games and fill them with characters and stories. • The Dungeon Master’s Guide (DMG) is full of tools to help you immerse players in the game. What’s the demon lord’s secret weakness? Are the orcish invaders a criminal enterprise, or traitorous allies? Dozens of tables throughout the book help inspire your decisions and keep the game flowing smoothly. • In the Dungeon Master’s Guide (DMG), even the tables tell tales. A legendary sword takes five decades to craft. Who created it, and why? A tavern-crawling gnome has an eye twitch. How did she get it, and when? In every detail is an architecture for narrative—and the Dungeon Master’s Guide has all the tools you need to flesh it out with ease. • In Dungeons & Dragons, you and your friends coauthor your own legend. Guided by a Dungeon Master, you create characters and play their roles in a story, rolling dice and navigating maps as you unfold a tale as limitless as your imagination. • Dungeons & Dragons is the world’s greatest roleplaying game. Created in 1974, D&D transformed gaming culture by blending traditional fantasy with miniatures and wargaming.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780786965625-L.jpg"
    },
    {
        "mmsId": "9952369252001401",
        "isbn": "9780316592598",
        "title": "My Head Has A Bellyache : And More Nonsense For Mischievous Kids And Immature Grown-Ups /",
        "author": "Harris, Chris, 1970- Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-02",
        "callNo": "811.6 H3135m 2023",
        "summary": "\"A witty, illustrated collection of humorous (and sometimes even heartwarming) poems and nonsense inspired by the absurdities of everyday life\"--",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780316592598-L.jpg"
    },
    {
        "mmsId": "9952369252201401",
        "isbn": "9781250800152",
        "title": "Magic: A History: From Alchemy To Witchcraft, From The Ice Age To The Present.",
        "author": "Gosden, Chris",
        "recStatus": "Yes",
        "recDate": "2023-10-02",
        "callNo": "Unknown",
        "summary": "An Oxford professor of archaeology explores the unique history of magic—the oldest and most neglected strand of human behavior and its resurgence today Three great strands of belief run through human history: Religion is the relationship with one god or many gods, masters of our lives and destinies. Science distances us from the world, turning us into observers and collectors of knowledge. And magic is direct human participation in the universe: we have influence on the world around us, and the world has influence on us. Over the last few centuries, magic has developed a bad reputation—thanks to the unsavory tactics of shady practitioners, and to a successful propaganda campaign on the part of religion and science, which denigrated magic as backward, irrational, and “primitive.” In Magic, however, the Oxford professor of archaeology Chris Gosden restores magic to its essential place in the history of the world—revealing it to be an enduring element of human behavior that plays an important role for individuals and cultures. From the curses and charms of ancient Greek, Roman, and Jewish magic, to the shamanistic traditions of Eurasia, indigenous America, and Africa; from the alchemy of the Renaissance to the condemnation of magic in the colonial period and the mysteries of modern quantum physics—Gosden’s startling, fun, and colorful history supplies a missing chapter of the story of our civilization. Drawing on decades of research around the world—touching on the first known horoscope, a statue ordered into exile, and the mystical power of tattoos—Gosden shows what magic can offer us today, and how we might use it to rethink our relationship with the world. Magic is an original, singular, and sweeping work of scholarship, and its revelations will leave a spell on the reader.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781250800152-L.jpg"
    },
    {
        "mmsId": "9952372934001401",
        "isbn": "9781138055278",
        "title": "Readings For Diversity And Social Justice /",
        "author": "",
        "recStatus": "Yes",
        "recDate": "2023-10-02",
        "callNo": "305.80097 R2874 2018",
        "summary": "For nearly 20 years, Readings for Diversity and Social Justice has been the trusted, leading anthology to cover a wide range of social oppressions from a social justice standpoint. With full sections dedicated to racism, religious oppression, classism, ableism, youth and elder oppression, as well as an integrative section dedicated to sexism, heterosexism, and transgender oppression, this bestselling text goes far beyond the range of traditional readers. New essay selections in each section of this fourth edition have been carefully chosen to keep topic coverage timely and readings accessible and engaging for students. The interactions among these topics are highlighted throughout to stress the interconnections among oppressions in everyday life. A Table of Intersections leads you to selections not in the section dedicated to an issue. Retaining the key features and organization that has made Readings for Diversity and Social Justice an indispensable text for teaching issues of social justice while simultaneously updating and expanding its coverage, this new edition features: Over 40 new selections considering current topics and events such as the Black Lives Matter movement, workplace immigration raids, gentrification, wealth inequality, the disability rights of prisoners and inmates, and the Keystone XL pipeline protests. An updated companion website with additional resources and short classroom-friendly videos that further complement the readings in each section. A holistic approach to sexism, gay, lesbian, trans and gender-queer oppression that challenges widely-held assumptions about the usual practice of separating analyses of sex and gender binaries. A more optimistic focus on the role of social justice at all levels of society, whether personal, institutional local, or global, and the intersections among them. Offering over 140 selections from some of the foremost scholars in a wide range of fields, Readings for Diversity and Social Justice is the indispensable volume for every student, teacher, and social justice advocate.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781138055278-L.jpg"
    },
    {
        "mmsId": "9952353852601401",
        "isbn": "9781803363523",
        "title": "Ghibli Recipe Book.",
        "author": "Vilanova, Thibaud",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "summary": "Create 40 delicious dishes from your favourite Studio Ghibli films! 40 recipes inspired by the masterpieces of Studio Ghibli: My Neighbour Totoro, Spirited Away, Princess Mononoke, Howl's Moving Castle... Dive into the dreamlike worlds of these animated films and enjoy the recipes created by Thibaud Villanova, a specialist in the cuisine of the imagination.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781803363523-L.jpg"
    },
    {
        "mmsId": "9952356751101401",
        "isbn": "9780807766132",
        "title": "Native Presence And Sovereignty In College: Sustaining Indigenous Weapons To Defeat Systemic Monster",
        "author": "Tachine, Amanda R",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "summary": "What is at stake when our young people attempt to belong to a college environment that reflects a world that does not want them for who they are? In this compelling book, Navajo scholar Amanda Tachine takes a personal look at 10 Navajo teenagers, following their experiences during their last year in high school and into their first year in college. It is common to think of this life transition as a time for creating new connections to a campus community, but what if there are systemic mechanisms lurking in that community that hurt Native students' chances of earning a degree? Tachine describes these mechanisms as systemic monsters and shows how campus environments can be sites of harm for Indigenous students due to factors that she terms monsters' sense of belonging, namely assimilating, diminishing, harming the worldviews of those not rooted in White supremacy, heteropatriarchy, capitalism, racism, and Indigenous erasure. This book addresses the nature of those monsters and details the Indigenous weapons that students use to defeat them. Rooted in love, life, sacredness, and sovereignty, these weapons reawaken students' presence and power. Book Features: Introduces an Indigenous methodological approach called story rug that demonstrates how research can be expanded to encompass all our senses. Weaves together Navajo youths' stories of struggle and hope in educational settings, making visible systemic monsters and Indigenous weaponry. Draws from Navajo knowledge systems as an analytic tool to connect history to present and future realities. Speaks to the contemporary situation of Native peoples, illuminating the challenges that Native students face in making the transition to college. Examines historical and contemporary realities of Navajo systemic monsters, such as the financial hardship monster, deficit (not enough) monster, failure monster, and (in)visibility monster. Offers insights for higher education institutions that are seeking ways to create belonging for diverse students.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780807766132-L.jpg"
    },
    {
        "mmsId": "9952356751601401",
        "isbn": "9781737277521",
        "title": "Punks: New & Selected Poems.",
        "author": "Keene, John, 1965-",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "summary": "A landmark collection of poetry by acclaimed fiction writer, translator, and MacArthur Fellow John Keene, PUNKS: NEW & SELECTED POEMS is a generous treasury in seven sections that spans decades and includes previously unpublished and brand new work. With depth and breadth, PUNKS weaves together historic narratives of loss, lust, and love. The many voices that emerge in these poems--from historic Black personalities, both familial and famous, to the poet's friends and lovers in gay bars and bedrooms--form a cast of characters capable of addressing desire, oppression, AIDS, and grief through sorrowful songs that \"we sing as hard as we live.\" At home in countless poetic forms, PUNKS reconfirms John Keene as one of the most important voices in contemporary poetry. \"John Keene's PUNKS is utterly brilliant. The range, vision, depth and humanity he brings to the page are as galactic as Banneker's astral wanderings, as crisp as the chordal cutting of a searching horn, as courageous and small as a nose wide open. Keene's masterfully inventive inquiry of self and history is queered, Blackened, and joyously thick with multitudes of voice and valence. Amen to this exploration!\"--Tyehimba Jess Poetry. African & African American Studies. LGBTQIA Studies.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781737277521-L.jpg"
    },
    {
        "mmsId": "9952356751701401",
        "isbn": "9781419752438",
        "title": "Mimosa.",
        "author": "Bongiovanni, Archie",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "summary": "Archie Bongiovanni, the comics artist behind the hit A Quick and Easy Guide to They/Them Pronouns, explores queerness in this shockingly frank and funny adult graphic novel Best friends Chris, Jo, Elise, and Alex work hard to keep themselves afloat. Their regular brunches hold them together even as the rest of their lives threaten to fall completely apart. In an effort to avoid being the oldest gays at the party (like they are at every other queer event in Minneapolis), the crew decides to put on a new party called Grind!, a queer gathering specifically for folks in or over their dirty-thirties. Each character is at a crossroads: Chris is experiencing not only the loss of their queer community after a messy divorce, but the struggles of being a single parent. Jo has to choose between assimilating into a financially stable job or letting her freak flag (and nipples) fly. Elise is caught between feelings for her boss and the career of her dreams. And Alex is guarding a secret that might change his friendships forever. All the while the group must navigate homophobic PTA meetings, exes at work, physical and mental exhaustion, and drinking way, way too much on weekdays. These queer friends struggle to decompartmentalize their lives so they can truly nurture themselves and each other. Together they learn that chosen family doesn't only mean the friends you've known the longest and that sometimes growing up also means growing apart.",
        "coverurl": "https://books.google.com/books/content?id=3RftzgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api"
    },
    {
        "mmsId": "9952356752001401",
        "isbn": "9781338617566",
        "title": "Heartstopper.",
        "author": "Oseman, Alice, Author, Artist.",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Fiction O817h v.4",
        "summary": "Boy meets boy. Boys become friends. Boys fall in love. A sweet and charming coming-of-age story that explores friendship, love, and coming out. This edition features beautiful two-color artwork. Absolutely delightful. Sweet, romantic, kind. Beautifully paced. I loved this book. -- Rainbow Rowell, author of Carry On Shy and softhearted Charlie Spring sits next to rugby player Nick Nelson in class one morning. A warm and intimate friendship follows, and that soon develops into something more for Charlie, who doesn't think he has a chance. But Nick is struggling with feelings of his own, and as the two grow closer and take on the ups and downs of high school, they come to understand the surprising and delightful ways in which love works.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781338617566-L.jpg"
    },
    {
        "mmsId": "9952356851901401",
        "isbn": "9781250810205",
        "title": "The Book Eaters /",
        "author": "Dean, Sunyi, Author.",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Fiction D282b 2023",
        "summary": "\"I devoured this.\"—V. E. Schwab, New York Times bestselling author of The Invisible Life of Addie La Rue An International Bestseller An NPR Best Sci Fi, Fantasy, & Speculative Fiction Book of 2022 A Book Riot Best Book of 2022 A Vulture Best Fantasy Novel of 2022 A Goodreads Best Fantasy Choice Award Nominee A Library Journal Best Book of 2022 Out on the Yorkshire Moors lives a secret line of people for whom books are food, and who retain all of a book's content after eating it. To them, spy novels are a peppery snack; romance novels are sweet and delicious. Eating a map can help them remember destinations, and children, when they misbehave, are forced to eat dry, musty pages from dictionaries. Devon is part of The Family, an old and reclusive clan of book eaters. Her brothers grow up feasting on stories of valor and adventure, and Devon—like all other book eater women—is raised on a carefully curated diet of fairy tales and cautionary stories. But real life doesn't always come with happy endings, as Devon learns when her son is born with a rare and darker kind of hunger—not for books, but for human minds.",
        "coverurl": "https://books.google.com/books/content?id=3bWYEAAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api"
    },
    {
        "mmsId": "9952356852301401",
        "isbn": "9781955239240",
        "title": "Painting The Streets : Oakland Uprising In The Time Of Rebellion.",
        "author": "",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "751.73097 P1487 2022",
        "summary": "PAINTING THE STREETS: OAKLAND UPRISING IN THE TIME OF REBELLION is an oversized, hardcover, glossy, 9\" x 9\" full-color art book featuring the Oakland murals that emerged in tandem with the inter/national protests against the police brutality/murder of Black people and systemic-institutional racism in the US. The book also includes an intro, interview, poetry, and essays by writers in solidarity with the Black liberation struggle. Cover art photo by JJ Harris. Featured photographs by Rohan DaCosta. Introduction by Alicia Garza. Interview with Emory Douglas (conducted by Tongo Eisen-Martin). Essays by Robin D. G. Kelley, Cat Brooks, Greg Morozumi, Leslie Lopez, Mizan Alkebulan-Abakah, MPH & Sizwe Andrews-Abakah of Spearitwurx, and Black Cultural Zone's Art for the Movement Team: Carolyn Johnson, Mizan Alkebulan-Abakah, MPH, and Randolph Belle. Poetry by Sonia Sanchez, Umar Bin Hassan, Tureeda Mikell, Ayodele Nzinga, James Cagney, Tongo Eisen-Martin, Arnoldo García, Sizwe, Maisha Quint, Nia McAllister, Da'Juan Carter-Woodard, and Amiri Baraka. Featured artists/arts organizations include BAMP (Bay Area Mural Program), Rachel Wolfe-Goldsmith, Timothy B, Anya Riddell-Kaufman, David Burke, Sharon Virtue, and Zoë Boston. Artists include Alex Sodari, Alrad, Bud Snow, Cece Carpio, Chip F. Beal, Chris Granillo, Daniel Camacho, David Foreman, Elizabeth Peña, Eugenia Ho, Fay Banawis, ghost ghost teeth, Girl Mobb, Griffin One, Jude Capili, Jun Yang, Kathy Liang, Keena Azania Romano, KeeneVisions, Lynn Huang, Maxx Slaughter, Nite Owl, Pancho Pescador, Parul Sharma, Rafael Tapia III, Richard Choi, Serina Jasmin Koester, Shara Shimabukuro, Shawn Gibson, Shi Shi, Taylor Apple, The Tracy Piper, Wanli Wang, Zachary Sweet, and more being added! Poetry. California Interest. African & African American Studies. Art.",
        "coverurl": "https://books.google.com/books/content?id=xBS3zgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api"
    },
    {
        "mmsId": "9952363887501401",
        "isbn": "9780593308462",
        "title": "On Top Of Glass : My Stories As A Queer Girl In Figure Skating /",
        "author": "Manta, Karina, 1996- Author.",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "796.91 M291 2021",
        "summary": "An insightful memoir from a figure skating champion about her life as a bisexual professional athlete, perfect for readers of Fierce by Aly Raisman and Forward by Abby Wambach. Karina Manta has had a busy few years: Not only did she capture the hearts of many with her fan-favorite performance at the U.S. Figure Skating Championships, she also became the first female figure skater on Team USA to come out as queer. Her Modern Love essay \"I Can't Hate My Body if I Love Hers\" was published in the New York Times, and then she joined the circus--Cirque du Soleil's on-ice show, AXEL. Karina's memoir covers these experiences and much more. Attending a high school with 4,000 students, you'd expect to know more than two openly gay students, but Karina didn't meet an out-lesbian until she was nearly seventeen--let alone any other kind of queer woman. But this isn't just a story about her queerness. It's also a story about her struggle with body image in a sport that prizes delicate femininity. It's a story about panic attacks, and first crushes, and all the crushes that followed, and it's a story about growing up, feeling different than everybody around her and then realizing that everyone else felt different too.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780593308462-L.jpg"
    },
    {
        "mmsId": "9952363887701401",
        "isbn": "9780593203439",
        "title": "One Life : Adapted For Young Readers /",
        "author": "Rapinoe, Megan, 1985- Author.",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "796.334 R218 2021",
        "summary": "Adapted for young readers! Join two-time Women's World Cup champion, Olympic gold medalist, and trailblazing activist Megan Rapinoe in the fight for equality and justice in this middle grade adaptation of her New York Times bestselling memoir, One Life. You know Megan Rapinoe as an international soccer superstar! She's also a fierce activist, boldly speaking out about issues of equality and justice--from LGBTQ rights to the equal pay movement to Black Lives Matter. In this adaptation for middle school readers of her memoir One Life, get to know Megan: from her childhood in a small California town where she learned to play soccer and how to fight for social justice; through high school, college and beyond; to 2016 when she became the first high-profile white athlete to take a knee in support of Colin Kaepernik, and also suing the United States Soccer Federation along with her teammates over gender discrimination. Using stories from her own life and career, Rapinoe discusses the responsibility we have to speak up. In this edition specifically for young readers, she reveals the impact everyone, even kids, can have on their communities and how kids can get involved in making the world a better place.",
        "coverurl": "https://books.google.com/books/content?id=VYtyzgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api"
    },
    {
        "mmsId": "9952363888501401",
        "isbn": "9780593113523",
        "title": "Ikenga /",
        "author": "Okorafor, Nnedi,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "summary": "Nnedi Okorafor's acclaimed first novel for middle grade readers introduces a boy who can access super powers with the help of the magical Ikenga. Nnamdi's father was a good chief of police, perhaps the best Kalaria had ever had. He was determined to root out the criminals that had invaded the town. But then he was murdered, and most people believed the Chief of Chiefs, most powerful of the criminals, was responsible. Nnamdi has vowed to avenge his father, but he wonders what a twelve-year-old boy can do. Until a mysterious nighttime meeting, the gift of a magical object that enables super powers, and a charge to use those powers for good changes his life forever. How can he fulfill his mission? How will he learn to control his newfound powers? Award-winning Nnedi Okorafor, acclaimed for her Akata novels, introduces a new and engaging hero in her first novel for middle grade readers set against a richly textured background of contemporary Nigeria.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780593113523-L.jpg"
    },
    {
        "mmsId": "9952363889101401",
        "isbn": "9781784743048",
        "title": "Orange World : And Other Stories /",
        "author": "Russell, Karen, 1981- Author.",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Fiction R9646o 2019",
        "summary": "Karen Russell's comedic genius and mesmerising talent for creating outlandish predicaments that uncannily mirror our inner lives are on display in these exuberant, unforgettable stories. In 'The Bad Graft', a couple on a road trip stop in Joshua Tree National Park, where the spirit of a giant tree accidentally infects the young woman, their fates becoming permanently entangled. In 'The Prospectors' two opportunistic young women fleeing the Depression strike out for new territory, but find themselves fighting for their lives. In the brilliant and hilarious title story a new mother desperate to ensure her baby's safety strikes a diabolical deal - as long as the devil protects her baby, she'll do anything. Stories of survival, love and of surreal and magnificent transformation - even in their darkness, these stories give us an escape. Just as many of the characters make a leap - whether to a different world or a different state - we go along for the ride as Russell takes us to strange and exhilarating new heights. This is haunting and beautiful work from one of America's most gifted writers. 'Russell can take Antarctic tailgaters, an army of seagulls or simply a window and twist a tale that explodes on the page and lingers in the mind' The Times",
        "coverurl": "https://books.google.com/books/content?id=nmOfvQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api"
    },
    {
        "mmsId": "9952363889301401",
        "isbn": "9780525516255",
        "title": "Hot Dog Girl /",
        "author": "Dugan, Jennifer,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "summary": "A fresh and funny contemporary YA rom-com about teens working as costumed characters in a local amusement part. \"I'm wrecked with love for this funny, joyful, bighearted book.\" --Becky Albertalli, bestselling author of Simon vs. the Homo Sapiens Agenda Elouise (Lou) Parker is determined to have the absolute best, most impossibly epic summer of her life. There are just a few things standing in her way: She's landed a job at Magic Castle Playland . . . as a giant dancing hot dog. Her crush, the dreamy diving pirate Nick, already has a girlfriend, who is literally the princess of the park. But Lou's never liked anyone, guy or otherwise, this much before, and now she wants a chance at her own happily ever after. Her best friend, Seeley, the carousel operator, has always been up for anything, but she's decidedly not on board when it comes to Lou's quest to set her up with the perfect girl or Lou's scheme to get close to Nick. And it turns out that this will be their last summer at Magic Castle Playland--ever--unless she can find a way to stop it from closing. Jennifer Dugan's sparkling debut coming-of-age queer romance stars a princess, a pirate, a hot dog, and a carousel operator who find love--and themselves--in unexpected people and unforgettable places. \"Both classic and new, hysterical and heartfelt, and packed with all the awesomeness and awkwardness of first love, first job, and the painful thrill of growing up.\" --Mackenzi Lee, bestselling author of The Gentleman's Guide to Vice and Virtue",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780525516255-L.jpg"
    },
    {
        "mmsId": "9952363889401401",
        "isbn": "9780525515609",
        "title": "Sugar Town Queens /",
        "author": "Nunn, Malla,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "summary": "From Los Angeles Times Book Prize Award winner and Edgar Award nominee Malla Nunn comes a stunning portrait of a family divided and a powerful story of how friendship saves and heals. When Amandla wakes up on her fifteenth birthday, she knows it's going to be one of her mother's difficult days. Her mother has had another vision. This one involves Amandla wearing a bedsheet loosely stitched as a dress. An outfit, her mother says, is certain to bring Amandla's father back home, as if he were the prince and this was the fairytale ending their family was destined for. But in truth, Amandla's father has long been gone--since before Amandla was born--and even her mother's memory of him is hazy. In fact, many of her mother's memories from before Amandla was born are hazy. It's just one of the many reasons people in Sugar Town give them strange looks--that and the fact her mother is white and Amandla is Black. When Amandla finds a mysterious address in the bottom of her mother's handbag along with a large amount of cash, she decides it's finally time to get answers about her mother's life. What she discovers will change the shape and size of her family forever. But with her best friends at her side, Amandla is ready to take on family secrets and the devil himself. These Sugar Town queens are ready to take over the world to expose the hard truths of their lives.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780525515609-L.jpg"
    },
    {
        "mmsId": "9952363889601401",
        "isbn": "9781984896681",
        "title": "Kiki's Delivery Service /",
        "author": "Kadono, Eiko,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "summary": "Read the modern classic about a young witch and her clever cat that started it all! Nostalgic fans of the Hiyao Miyazaki film, Kiki's Delivery Service and newcomers alike will love this exciting new translation of the beloved fantasy story. \"This new translation is perfect.\" --School Library Journal Half-witch Kiki never runs from a challenge. So when her thirteenth birthday arrives, she's eager to follow a witch's tradition: choose a new town to call home for one year. Brimming with confidence, Kiki flies to the seaside village of Koriko and expects that her powers will easily bring happiness to the townspeople. But gaining the trust of the locals is trickier than she expected. With her faithful, wise-cracking black cat, Jiji, by her side, Kiki forges new friendships and builds her inner strength, ultimately realizing that magic can be found in even the most ordinary places. Blending fantasy with the charm of everyday life, this enchanting new translation will inspire both new readers and dedicated fans.",
        "coverurl": "https://books.google.com/books/content?id=REOREAAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api"
    },
    {
        "mmsId": "9952363889701401",
        "isbn": "9780375970504",
        "title": "The Fitzosbornes At War /",
        "author": "Cooper, Michelle,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "summary": "Originally published: North Sydney, NSW: Random House Australia, 2012.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780375970504-L.jpg"
    },
    {
        "mmsId": "9952363890101401",
        "isbn": "9780375958656",
        "title": "The Fitzosbornes In Exile /",
        "author": "Cooper, Michelle,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "summary": "In January 1937, as Sophia FitzOsborne continues to record in her journal, the members of Montmaray's royal family are living in luxurious exile in England but, even as they participate in the social whirl of London parties and balls, they remain determined to free their island home from the occupying Germans despite growing rumors of a coming war that might doom their country forever.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780375958656-L.jpg"
    },
    {
        "mmsId": "9952363890201401",
        "isbn": "9781984815248",
        "title": "My Eyes Are Up Here /",
        "author": "Zimmermann, Laura, 1970- Author.",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Fiction Z74m 2020",
        "summary": "My Eyes Are Up Here is a razor-sharp debut about a girl struggling to rediscover her sense of self in the year after her body decided to change all the rules. If Greer Walsh could only live inside her head, life would be easier. She’d be able to focus on excelling at math or negotiating peace talks between her best friend and . . . everyone else. She wouldn’t spend any time worrying about being the only Kennedy High student whose breasts are bigger than her head. But you can’t play volleyball inside your head. Or go to the pool. Or have confusingly date-like encounters with the charming new boy. You need an actual body for all of those things. And Greer is entirely uncomfortable in hers. Hilarious and heartbreakingly honest, My Eyes Are Up Here is a story of awkwardness and ferocity, of imaginary butterflies and rock-solid friends. It’s the story of a girl finding her way out of her oversized sweatshirt and back into the real world.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781984815248-L.jpg"
    },
    {
        "mmsId": "9952363890401401",
        "isbn": "9781984814654",
        "title": "Maya And The Robot /",
        "author": "Ewing, Eve L., Author.",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Fiction E953m 2021",
        "summary": "From award-winning author Eve L. Ewing comes an illustrated middle grade novel about a forgotten homemade robot who comes to life just when aspiring fifth-grade scientist Maya needs a friend -- and a science fair project. Maya's nervous about fifth grade. She tries to keep calm by reminding herself she knows what to expect. But then she learns that this year won't be anything like the last. For the first time since kindergarten, her best friends Jada and MJ are placed in a different class without her, and introverted Maya has trouble making new friends. She tries to put on a brave face since they are in fifth grade now, but Maya is nervous! Just when too much seems to be changing, she finds a robot named Ralph in the back of Mr. Mac's convenience store closet. Once she uses her science skills to get him up and running, a whole new world of connection opens up as Ralph becomes a member of her family and Maya begins to step into her power. In this touching novel, Eve L. Ewing melds together a story about community, adapting to change, and the magic of ingenuity that reminds young readers that they can always turn to their own curiosity when feeling lost.",
        "coverurl": "https://books.google.com/books/content?id=TO5nEAAAQBAJ&printsec=frontcover&img=1&zoom=10&source=gbs_api"
    },
    {
        "mmsId": "9952363891501401",
        "isbn": "9781771474344",
        "title": "Meranda And The Legend Of The Lake /",
        "author": "Mahoney, Meagan, Author.",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Fiction M2164m 2021",
        "summary": "Anne of Green Gables meets Song for a Whale with a touch of Nancy Drew Eleven-year-old Meranda thought her life was complicated enough with physical challenges (she uses crutches to walk) and her helicopter parents. But when her great-uncle Mark dies, Meranda and her family visit Cape Breton, Nova Scotia, where her parents grew up and where she hasn't been since the age of three. Soon, secrets begin to unfold: Why does the newspaper headline say her great-uncle Mark's death was suspicious? Why do strangers keep calling Meranda \"miracle baby\"? Why does her usually calm mother seem so panicky and scared? And what on earth does all this have to do with mermaids? Meranda and her new friend, Claire, decide to investigate on their own. But as Meranda begins to separate fact from fiction, she finds herself in very real danger ... With an intriguing mystery afoot, and a strong-willed, resilient heroine at the helm, this mythical maritime novel celebrates coming of age and growing into yourself.",
        "coverurl": "https://books.google.com/books/content?id=GRUozgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api"
    },
    {
        "mmsId": "9952363892201401",
        "isbn": "9781734225914",
        "title": "In One Ear & Out The Other : Antonia Brico & Her Amazingly Musical Life /",
        "author": "Worthey, Diane,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "summary": "\"In an era when women couldn't become conductors, Antonia Brico didn't listen to discouraging words. The words went in one ear and out the other. The second title in Penny Candy's Amazing Women Series of nonfiction picture books, In One Ear and Out the Other: The Amazing, Musical Life of Antonia Brico tells the story of one woman's fight to gain recognition as a conductor in an era when men dominated classical music. The first woman to guest-conduct the New York Philharmonic Orchestra, Antonia Brico never secured a permanent conducting job with a major symphony-but her contributions paved the way for the many women conductors to follow. A true visionary in the long fight for equal opportunities for women\"--",
        "coverurl": "https://books.google.com/books/content?id=NSxXywEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api"
    },
    {
        "mmsId": "9952363892401401",
        "isbn": "9781725342255",
        "title": "Charles Babbage And Ada Lovelace : The Pen Pals Who Imagined The First Computer /",
        "author": "Lucas, Eileen, Author.",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "510.92 L9334 2021",
        "summary": "Charles Babbage and Ada Byron met in 1833. He was a widowed forty-two-year-old scientist and inventor, who was trying to figure out how to get his Difference Engine built. She was the eighteen-year-old daughter of the poet Lord Byron and Lady Annabella Byron, whose marriage had disintegrated in Ada's youth. Through thoughtful narrative accompanied by direct quotes, readers will learn how in Babbage's plans for the Analytical Engine and Lovelace's algorithm lies the foundation of the computer hardware and software that would not be developed for another hundred plus years. Sidebars, a chronology, and a further reading list provide more information on this inspirational collaboration.",
        "coverurl": "https://books.google.com/books/content?id=OCxbzQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api"
    },
    {
        "mmsId": "9952363892701401",
        "isbn": "9780063038844",
        "title": "Meet Cute Diary /",
        "author": "Lee, Emery, 1996- Author.",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Fiction L4778m 2021",
        "summary": "Felix Ever After meets Becky Albertalli in this swoon-worthy, heartfelt rom-com about how a transgender teen's first love challenges his ideas about perfect relationships. Noah Ramirez thinks he's an expert on romance. He has to be for his popular blog, the Meet Cute Diary, a collection of trans happily ever afters. There's just one problem--all the stories are fake. What started as the fantasies of a trans boy afraid to step out of the closet has grown into a beacon of hope for trans readers across the globe. When a troll exposes the blog as fiction, Noah's world unravels. The only way to save the Diary is to convince everyone that the stories are true, but he doesn't have any proof. Then Drew walks into Noah's life, and the pieces fall into place: Drew is willing to fake-date Noah to save the Diary. But when Noah's feelings grow beyond their staged romance, he realizes that dating in real life isn't quite the same as finding love on the page. In this charming novel by Emery Lee, Noah will have to choose between following his own rules for love or discovering that the most romantic endings are the ones that go off script. A Junior Library Guild Selection",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780063038844-L.jpg"
    },
    {
        "mmsId": "9952363892901401",
        "isbn": "9780063024793",
        "title": "Excuse Me While I Ugly Cry /",
        "author": "Goffney, Joya,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "summary": "Excuse Me While I Ugly Cry by debut author Joya Goffney is an own voices story of an overly enthusiastic list maker who is blackmailed into completing a to-do list of all her worst fears. It's a heartfelt, tortured, contemporary YA high school romance. Fans of Jenny Han's To All the Boys I've Loved Before and Kristina Forest's I Wanna Be Where You Are will love the juicy secrets and leap-off-the-page sexual tension. Quinn keeps lists of everything--from the days she's ugly cried, to \"Things That I Would Never Admit Out Loud\" and all the boys she'd like to kiss. Her lists keep her sane. By writing her fears on paper, she never has to face them in real life. That is, until her journal goes missing . . . Then an anonymous account posts one of her lists on Instagram for the whole school to see and blackmails her into facing seven of her greatest fears, or else her entire journal will go public. Quinn doesn't know who to trust. Desperate, she teams up with Carter Bennett--the last known person to have her journal--in a race against time to track down the blackmailer. Together, they journey through everything Quinn's been too afraid to face, and along the way, Quinn finds the courage to be honest, to live in the moment, and to fall in love.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780063024793-L.jpg"
    },
    {
        "mmsId": "9952363893401401",
        "isbn": "9781632358530",
        "title": "12 Stories About Helping After A Disaster /",
        "author": "Hutchison, Patricia, Author.",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "158.2 H9788 2020",
        "summary": "When earthquakes rocked Mexico in 2017, UNICEF brought drinking water and blankets. They also got children back to school. When wildfires raced through California in 2018, an MLB player and his teammates raised money for fire victims. Soon after Superstorm Sandy hit in 2012, an 11-year-old Florida boy designed a better sandbag. This book features 12 stories about making a difference when disaster strikes. Each chapter includes attention-grabbing photos and fascinating facts. Sidebars go beyond the basics, and prompts invite readers to think for themselves. A Ways You Can Help page offers suggestions anyone can try.",
        "coverurl": "https://books.google.com/books/content?id=Y-7zygEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api"
    },
    {
        "mmsId": "9952363893501401",
        "isbn": "9780062985651",
        "title": "The Mending Summer /",
        "author": "Standish, Ali, Author.",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Fiction S7856m 2021",
        "summary": "Perfect for fans of Orphan Island and Wishtree, The Mending Summer is the next stunning middle grade novel from Ali Standish--author of the Carnegie Medal nominee The Ethan I Was Before and August Isle, Bad Bella, and How to Disappear Completely--about a girl who is struggling to deal with her father's alcoholism when she discovers an enchanted lake... Some summers are meant to break your heart. Others to mend it. Every once in a while, a summer rolls around that does both. For Georgia, this summer is shaping up to be a big disappointment. Mama is busy studying for her biology degree. Daddy is working nights, and often the man who comes home isn't Daddy. He's a man who looks like Daddy, but walks a little wobbly. Who sounds like Daddy, but sings a little too loud. Georgia calls him the Shadow Man. So now, instead of riding horses with her friends at camp, Georgia is sent off to the country to stay with her mysterious great-aunt for the summer to avoid her parents' fighting. There, a lonely Georgia meets a mysterious friend named Angela and together, they discover a magical lake--one that can make wishes come true. At first, the lake offers Georgia a thrilling escape from her worries and hope that she can use its magic to heal her family. But as things grow worse at home, a troubled boy appears at the lake and the wishes threaten to spiral out of control . . . Award-winning author Ali Standish explores the courage it takes to piece your heart back together again when those closest to you break it.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780062985651-L.jpg"
    },
    {
        "mmsId": "9952363894601401",
        "isbn": "9781547609772",
        "title": "The Vanquishers /",
        "author": "Bayron, Kalynn, Author.",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Fiction B3618v 2022",
        "summary": "Twelve-year-old Malika \"Boog\" Wilson and her best friends have grown up idolizing The Vanquishers, a group of masked vampire hunters who wiped out the last hoard of the undead decades ago. For kids today, vampires feel more like fun comic book fodder than real life, and the days of garlic wreaths and early curfews are long gone. But when a new student, Aaron, joins Boog's crew, and goes missing after a school fundraiser, the kids suspect a vampire was involved. Boog is convinced their school counselor, Mr. Rupert, is hiding something and she is determined to save Aaron. No one ever expected The Vanquishers to return, but if their town needs protection from the undead, they know who to call. Inspired by Buffy the Vampire Slayer and The Watchmen, this adventure launches readers into an exciting new series.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781547609772-L.jpg"
    },
    {
        "mmsId": "9952363894701401",
        "isbn": "9780062937063",
        "title": "The House That Wasn't There /",
        "author": "Arnold, Elana K., Author.",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Fiction A753h 2021",
        "summary": "No summary.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780062937063-L.jpg"
    },
    {
        "mmsId": "9952363894801401",
        "isbn": "9781547606078",
        "title": "Every Body Shines : Sixteen Stories About Living Fabulously Fat /",
        "author": "",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "summary": "\"Sixteen stories celebrating fat teens with bodies of many shapes and from many communities, cultures, races, genders, and orientations in contemporary settings as well as fictional worlds\"--",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781547606078-L.jpg"
    },
    {
        "mmsId": "9952364021401401",
        "isbn": "9781536214116",
        "title": "Sunshine /",
        "author": "Bauer, Marion Dane,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "summary": "For most of Ben's life, he has been a kid without a mom. He has his dad, who knows Ben doesn't like oatmeal and always hugs Ben before bed. And he has Sunshine, his loyal little dog, who is never far from his side. But his mom, who left when he was young, has just been a story, faint in his memory. Now he's about to spend a whole week with her on her remote island in the middle of the northern Minnesota wilderness. Though he's nervous about bears and outhouses and what his mom will think of Sunshine, Ben has a plan. When a fire threatens his mom's island, Ben finally realizes everything he's been trying to forget and learns how to forgive his mom - and himself.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781536214116-L.jpg"
    },
    {
        "mmsId": "9952364021501401",
        "isbn": "9781536213652",
        "title": "The Secret Starling /",
        "author": "Eagle, Judith, Author.",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Fiction E116s 2021",
        "summary": "A tattered ballet slipper found under the floorboards of Braithwaite Manor may be the key to Clara’s sinister family secrets in this delightful, lightly Gothic mystery for fans of Maryrose Wood and Claire Legrand. Clara Starling lives a life of dull rules, deadly routine, and flavorless meals under her cold uncle's strict regime—until the day Uncle disappears, leaving Clara alone in his old mansion. When streetwise orphan Peter and his rescue cat arrive unexpectedly, the children seize the chance to live by their own rules. But when the pair’s wild romps through the halls of Braithwaite Manor reveal a single, worn ballet slipper, they are hurled into a mystery that will lead to London’s glittering Royal Opera House and the unraveling of twisted Starling family secrets of poison, passion, and murder. Diabolical villains, plucky orphans, and glamorous ballet stars populate this absorbing adventure with a classic feel.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781536213652-L.jpg"
    },
    {
        "mmsId": "9952364022201401",
        "isbn": "9781536207118",
        "title": "Polo Cowboy : A Novel /",
        "author": "Neri, Greg, Author.",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Fiction N445p 2021",
        "summary": "\"When Cole moves in with his dad, Harp, he thinks life will be sweet--just him and his horse, Boo, hanging out with Philadelphia's urban cowboys. But when Harp says he has to get a job, Cole winds up as a stable hand for the polo team at George Washington Military Academy, where the players are rich, white, and stuck-up--all except Ruthie, the team's first and only girl, who's determined to show the others she can beat them at their own game. As Cole and Ruthie become friends--and maybe more--he starts imagining his future, maybe even at the academy. But between long workdays, arrogant polo players, and a cousin trying to pull Cole into his dangerous business, that future seems remote. Will Cole find the courage to stand and be seen in a world determined to keep him out? With striking illustrations by Jesse Joshua Watson, celebrated author G. Neri's novel weaves themes of tenacity and community into a rousing sports story inspired by Philadelphia's real-life urban cowboys and polo players. How does a Black kid from North Philly wind up playing polo? The much-anticipated sequel to Ghetto Cowboy, now a major motion picture starring Idris Elba and Stranger Things's Caleb McLaughlin.\"--",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781536207118-L.jpg"
    },
    {
        "mmsId": "9952364022401401",
        "isbn": "9781536201819",
        "title": "Franklin Endicott And The Third Key /",
        "author": "Dicamillo, Kate,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "summary": "The latest tale from Deckawoo Drive—and New York Times best-selling creators Kate DiCamillo and Chris Van Dusen—is a balm for young worrywarts facing the unknown. Welcome back to Deckawoo Drive for a sixth endearing installment in the companion series to Kate DiCamillo’s New York Times best-selling Mercy Watson books. Frank Endicott is a worrier. He worries about lions, submarines, black holes, leprosy, and armadillos. He lists his worries alphabetically in a notebook and suffers vivid nightmares that even a certain neighborhood pig can’t dispatch. When he accompanies Eugenia Lincoln on an errand to duplicate a key at her favorite dark and dusty thrift shop, Frank earns fresh cause for alarm. Odd Buddy Lamp, the shop’s proprietor, has sent them home with the original key and its copy. Can Frank come to terms with the mystery without buckling under his mounting dread? With a little help from friends (old and new), hot cocoa, and some classic short stories read aloud, the prognosis is good.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781536201819-L.jpg"
    },
    {
        "mmsId": "9952364023801401",
        "isbn": "9781524701291",
        "title": "Holler Of The Fireflies /",
        "author": "Moore, David Barclay,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "summary": "A boy from the hood in Brooklyn travels to a STEM camp in an Appalachian holler for one epic, life-changing summer. A brilliant new novel from the award-winning author of The Stars Beneath Our Feet. Javari knew that West Virginia would be different from his home in Bushwick, Brooklyn. But his first day at STEM Camp in a little Appalachian town is still a shock. Though run-ins with the police are just the same here. Not good. Javari will learn a lot about science, tech, engineering, and math at camp. And also about rich people, racism, and hidden agendas. But it’s Cricket, a local boy, budding activist, and occasional thief, who will show him a different side of the holler—and blow his mind wide open. Javari is about to have that summer. Where everything gets messy and complicated and confusing . . . and you wouldn’t want it any other way. J + C + summer = ∞",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781524701291-L.jpg"
    },
    {
        "mmsId": "9952364024001401",
        "isbn": "9781481498999",
        "title": "Take Me Home Tonight /",
        "author": "Matson, Morgan, Author.",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Fiction M4343t 2021",
        "summary": "Ferris Bueller’s Day Off meets Nick and Norah’s Infinite Playlist in this romp through the city that never sleeps from the New York Times bestselling author of Since You’ve Been Gone. Two girls. One night. Zero phones. Kat and Stevie—best friends, theater kids, polar opposites—have snuck away from the suburbs to spend a night in New York City. They have it all planned out. They’ll see a play, eat at the city’s hottest restaurant, and have the best. Night. Ever. What could go wrong? Well. Kind of a lot? They’re barely off the train before they’re dealing with destroyed phones, family drama, and unexpected Pomeranians. Over the next few hours, they’ll have to grapple with old flames, terrible theater, and unhelpful cab drivers. But there are also cute boys to kiss, parties to crash, dry cleaning to deliver (don’t ask), and the world’s best museum to explore. Over the course of a wild night, both Kat and Stevie will get a wake-up call about their friendship, their choices…and finally discover what they really want for their future. That is, assuming they can make it to Grand Central before the clock strikes midnight.",
        "coverurl": "https://books.google.com/books/content?id=XgIFzgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api"
    },
    {
        "mmsId": "9952364024101401",
        "isbn": "9781452181554",
        "title": "The Way Past Winter /",
        "author": "Hargrave, Kiran Millwood, 1990- Author.",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Fiction H2793w 2020",
        "summary": "\"Originally published in the United Kingdom in 2018 by Chicken House Ltd.\"",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781452181554-L.jpg"
    },
    {
        "mmsId": "9952364024801401",
        "isbn": "9781335915849",
        "title": "If You Could See The Sun /",
        "author": "Liang, Ann,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "summary": "\"Utterly unique, thought-provoking, and wonderfully written... a thrilling ride that hooked me from start to finish.\" --Gloria Chao, author of American Panda and Rent a Boyfriend In this genre-bending YA debut, a Chinese American girl monetizes her strange new invisibility powers by discovering and selling her wealthy classmates' most scandalous secrets. Alice Sun has always felt invisible at her elite Beijing international boarding school, where she's the only scholarship student among China's most rich and influential teens. But then she starts uncontrollably turning invisible--actually invisible. When her parents drop the news that they can no longer afford her tuition, even with the scholarship, Alice hatches a plan to monetize her strange new power--she'll discover the scandalous secrets her classmates want to know, for a price. But as the tasks escalate from petty scandals to actual crimes, Alice must decide if it's worth losing her conscience--or even her life.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781335915849-L.jpg"
    },
    {
        "mmsId": "9952364025401401",
        "isbn": "9780823444946",
        "title": "Brother's Keeper /",
        "author": "Lee, Julie,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "summary": "With war looming on the horizon and winter setting in, can two children escape North Korea on their own? Winner of the Freeman Book Award! North Korea. December, 1950. Twelve-year-old Sora and her family live under an iron set of rules: No travel without a permit. No criticism of the government. No absences from Communist meetings. Wear red. Hang pictures of the Great Leader. Don't trust your neighbors. Don't speak your mind. You are being watched. But war is coming, war between North and South Korea, between the Soviets and the Americans. War causes chaos--and war is the perfect time to escape. The plan is simple: Sora and her family will walk hundreds of miles to the South Korean city of Busan from their tiny mountain village. They just need to avoid napalm, frostbite, border guards, and enemy soldiers. But they can't. And when an incendiary bombing changes everything, Sora and her little brother Young will have to get to Busan on their own. Can a twelve-year-old girl and her eight-year-old brother survive three hundred miles of warzone in winter? Haunting, timely, and beautiful, this harrowing novel from a searing new talent offers readers a glimpse into a vanished time and a closed nation. A Jane Addams Children's Book Award Finalist An ILA Intermediate Fiction Award Winner An American Library Association Notable Children’s Book A Kirkus Reviews Best Book of the Year A Junior Library Guild Selection A Bank Street Best Children's Book of the Year \"Will ultimately be recognized as one of the best books... on the Korean War.\"—Education About Asia, the Association for Asian Studies",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780823444946-L.jpg"
    },
    {
        "mmsId": "9952364026001401",
        "isbn": "9780762465477",
        "title": "In The Key Of Nira Ghani /",
        "author": "Deen, Natasha, Author.",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Fiction D3117i 2019",
        "summary": "A Guyanese girl must find the balance between her parents' \"old world\" expectations and traditions while pursuing her dream of being a great trumpeter in this contemporary, coming-of-age story, written by an #OwnVoices author. Nira Ghani has always dreamed of becoming a musician. Her Guyanese parents, however, have big plans for her to become a scientist or doctor. Nira's grandmother and her best friend, Emily, are the only people who seem to truly understand her desire to establish an identity outside of the one imposed on Nira by her parents. When auditions for jazz band are announced, Nira realizes it's now or never to convince her parents that she deserves a chance to pursue her passion. As if fighting with her parents weren't bad enough, Nira finds herself navigating a new friendship dynamic when her crush, Noah, and notorious mean-girl, McKenzie \"Mac,\" take a sudden interest in her and Emily, inserting themselves into the fold. So, too, does Nira's much cooler (and very competitive) cousin Farah. Is she trying to wiggle her way into the new group to get closer to Noah? Is McKenzie trying to steal Emily's attention away from her? As Farah and Noah grow closer and Emily begins to pull away, Nira's trusted trumpet \"George\" remains her constant, offering her an escape from family and school drama. But it isn't until Nira takes a step back that she realizes she's not the only one struggling to find her place in the world. As painful truths about her family are revealed, Nira learns to accept people for who they are and to open herself in ways she never thought possible. A relatable and timely contemporary, coming-of age story, In the Key of Nira Ghani explores the social and cultural struggles of a teen in an immigrant household.",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780762465477-L.jpg"
    }
]