[
    {
        "mmsId": "9952356751001401",
        "isbn": "9781984859525",
        "title": "Project 562 : Changing The Way We See Native America /",
        "author": "Wilbur, Matika, Author, Photographer.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "970.00497 W666 2023",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781984859525-L.jpg",
        "summary": "A photographic and narrative celebration of contemporary Native American life and cultures, alongside an in-depth examination of issues that Native people face, by celebrated photographer and storyteller Matika Wilbur of the Swinomish and Tulalip Tribes. In 2012, Matika Wilbur sold everything in her Seattle apartment and set out on a Kickstarter-funded pursuit to visit, engage, and photograph people from what were then 562 federally recognized Native American Tribal Nations. Over the next decade, she traveled six hundred thousand miles across fifty states—from Seminole country (now known as the Everglades) to Inuit territory (now known as the Bering Sea)—to meet, interview, and photograph hundreds of Indigenous people. The body of work Wilbur created serves to counteract the one-dimensional and archaic stereotypes of Native people in mainstream media and offers justice to the richness, diversity, and lived experiences of Indian Country. The culmination of this decade-long art and storytelling endeavor, Project 562 is a peerless, sweeping, and moving love letter to Indigenous Americans, containing hundreds of stunning portraits and compelling personal narratives of contemporary Native people—all photographed in clothing, poses, and locations of their choosing. Their narratives touch on personal and cultural identity as well as issues of media representation, sovereignty, faith, family, the protection of sacred sites, subsistence living, traditional knowledge-keeping, land stewardship, language preservation, advocacy, education, the arts, and more. A vital contribution from an incomparable artist, Project 562 inspires, educates, and truly changes the way we see Native America."
    },
    {
        "mmsId": "9952356751501401",
        "isbn": "9780593489727",
        "title": "Real Self-Care : A Transformative Program For Redefining Wellness (Crystals, Cleanses, And Bubble Baths Not Included) /",
        "author": "Lakshmin, Pooja, Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "613 L1929 2023",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780593489727-L.jpg",
        "summary": "From women’s mental health specialist and New York Times contributor Pooja Lakshmin, MD, comes a long-overdue reckoning with the contradictions of the wellness industry and a paradigm-shifting program for practicing real self-care that will empower, uplift, and maybe even start a revolution. You may have noticed that it’s nearly impossible to go even a couple days without coming across the term self-care. A word that encompasses any number of lifestyle choices and products—from juice cleanses to yoga workshops to luxury bamboo sheets—self-care has exploded in our collective consciousness as a panacea for practically all of women’s problems. Board-certified psychiatrist Dr. Pooja Lakshmin finds this cultural embrace of self-care incomplete at best and manipulative at worst. Fixing your troubles isn’t simple as buying a new day planner or signing up for a meditation class. These faux self-care practices keep us looking outward—comparing ourselves with others or striving for a certain type of perfection. Even worse, they exonerate an oppressive social system that has betrayed women and minorities. Real self-care, in contrast, is an internal, self-reflective process that involves making difficult decisions in line with our values, and when we practice it, we shift our relationships, our workplaces, and even our broken systems. In Real Self-Care, Lakshmin helps readers understand what a real practice of caring for yourself could—and does—look like. Using case studies from her practice, clinical research, and the down-to-earth style that she's become known for, Lakshmin provides a step-by-step program for real and sustainable change and solace. Packed with actionable strategies to deal with common problems, Real Self-Care is a complete roadmap for women to set boundaries and move past guilt, treat themselves with compassion, get closer to themselves, and assert their power. The result—having ownership over one’s own life— is nothing less than a personal and social revolution."
    },
    {
        "mmsId": "9952356852201401",
        "isbn": "9780593420324",
        "title": "Trust /",
        "author": "DíAz, HernáN, 1973- Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Fiction D5424t 2022",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780593420324-L.jpg",
        "summary": "WINNER OF THE PULITZER PRIZE FOR FICTION A NEW YORK TIMES BESTSELLER ONE OF THE NEW YORK TIMES TOP TEN BOOKS OF 2022 ONE OF BARACK OBAMA'S FAVORITE BOOKS OF 2022 LONGLISTED FOR THE 2022 BOOKER PRIZE “Buzzy and enthralling …A glorious novel about empires and erasures, husbands and wives, staggering fortunes and unspeakable misery…Fun as hell to read.” —Oprah Daily \"A genre-bending, time-skipping story about New York City’s elite in the roaring ’20s and Great Depression.\"—Vanity Fair “A riveting story of class, capitalism, and greed.” —Esquire \"Exhilarating.” —New York Times Even through the roar and effervescence of the 1920s, everyone in New York has heard of Benjamin and Helen Rask. He is a legendary Wall Street tycoon; she is the daughter of eccentric aristocrats. Together, they have risen to the very top of a world of seemingly endless wealth—all as a decade of excess and speculation draws to an end. But at what cost have they acquired their immense fortune? This is the mystery at the center of Bonds, a successful 1937 novel that all of New York seems to have read. Yet there are other versions of this tale of privilege and deceit. Hernan Diaz’s TRUST elegantly puts these competing narratives into conversation with one another—and in tension with the perspective of one woman bent on disentangling fact from fiction. The result is a novel that spans over a century and becomes more exhilarating with each new revelation. At once an immersive story and a brilliant literary puzzle, TRUST engages the reader in a quest for the truth while confronting the deceptions that often live at the heart of personal relationships, the reality-warping force of capital, and the ease with which power can manipulate facts."
    },
    {
        "mmsId": "9952369249601401",
        "isbn": "9781541674806",
        "title": "Sexed Up : How Society Sexualizes Us, And How We Can Fight Back /",
        "author": "Serano, Julia, Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "306.70973 S481 2022",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781541674806-L.jpg",
        "summary": "The author of landmark manifesto Whipping Girl exposes the violent ways we are all sexualized-then offers a bold path for resistance Feminists have long challenged the ways in which men tend to sexualize women. But pioneering activist, biologist, and trans woman Julia Serano argues that sexualization is a far more pervasive problem, as it's something that we all do to other people, often without being aware of it. Why do we perceive men as sexual predators and women as sexual objects? Why are LGBTQ+ people stereotyped as being sexually indiscriminate and deceptive? Why are people of color still being hypersexualized? These stereotypes push minorities farther into the margins, and even the privileged are policed from transgressing, lest they also become targets. Many view sexualization as a mere component of sexism, racism, or queerphobia, but Serano argues that liberation from sexual violence comes through collectively confronting sexualization itself."
    },
    {
        "mmsId": "9952369249901401",
        "isbn": "9780593490617",
        "title": "His Name Is George Floyd : One Man's Life And The Struggle For Racial Justice /",
        "author": "Samuels, Robert, 1984- Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "305.896 S1938 2022",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780593490617-L.jpg",
        "summary": "WINNER OF THE 2023 PULITZER PRIZE IN NONFICTION FINALIST FOR THE NATIONAL BOOK AWARD AND LOS ANGELES TIMES BOOK PRIZE; FINALIST FOR THE J. ANTHONY LUKAS PRIZE; A BCALA 2023 HONOR NONFICTION AWARD WINNER. A landmark biography by two prizewinning Washington Post reporters that reveals how systemic racism shaped George Floyd's life and legacy—from his family’s roots in the tobacco fields of North Carolina, to ongoing inequality in housing, education, health care, criminal justice, and policing—telling the story of how one man’s tragic experience brought about a global movement for change. “It is a testament to the power of His Name Is George Floyd that the book’s most vital moments come not after Floyd’s death, but in its intimate, unvarnished and scrupulous account of his life . . . Impressive.” —New York Times Book Review (Editors' Choice) “Since we know George Floyd’s death with tragic clarity, we must know Floyd’s America—and life—with tragic clarity. Essential for our times.” —Ibram X. Kendi, author of How to Be an Antiracist “A much-needed portrait of the life, times, and martyrdom of George Floyd, a chronicle of the racial awakening sparked by his brutal and untimely death, and an essential work of history I hope everyone will read.” —Henry Louis Gates, Jr., author of The Black Church: This Is Our Story, This Is Our Song The events of that day are now tragically familiar: on May 25, 2020, George Floyd became the latest Black person to die at the hands of the police, murdered outside of a Minneapolis convenience store by white officer Derek Chauvin. The video recording of his death set off the largest protest movement in the history of the United States, awakening millions to the pervasiveness of racial injustice. But long before his face was painted onto countless murals and his name became synonymous with civil rights, Floyd was a father, partner, athlete, and friend who constantly strove for a better life. His Name Is George Floyd tells the story of a beloved figure from Houston's housing projects as he faced the stifling systemic pressures that come with being a Black man in America. Placing his narrative within the context of the country's enduring legacy of institutional racism, this deeply reported account examines Floyd's family roots in slavery and sharecropping, the segregation of his schools, the overpolicing of his community amid a wave of mass incarceration, and the callous disregard toward his struggle with addiction—putting today's inequality into uniquely human terms. Drawing upon hundreds of interviews with Floyd's closest friends and family, his elementary school teachers and varsity coaches, civil rights icons, and those in the highest seats of political power, Washington Post reporters Robert Samuels and Toluse Olorunnipa offer a poignant and moving exploration of George Floyd’s America, revealing how a man who simply wanted to breathe ended up touching the world."
    },
    {
        "mmsId": "9952369250001401",
        "isbn": "9780415952514",
        "title": "Beyond Resistance! : Youth Activism And Community Change : New Democratic Possibilities For Practice And Policy For America's Youth /",
        "author": "",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "362.7083 B5737 2006",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780415952514-L.jpg",
        "summary": "First Published in 2006. Routledge is an imprint of Taylor & Francis, an informa company."
    },
    {
        "mmsId": "9952369250201401",
        "isbn": "9781771644341",
        "title": "Can You Hear The Trees Talking?: Discovering The Hidden Life Of The Forest.",
        "author": "Wohlleben, Peter, 1964-",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781771644341-L.jpg",
        "summary": "A walk in the park will never be the same after kids discover this awe-inspiring book. Meet Peter Wohlleben--but you can call him Peter the Forester! With his groundbreaking, internationally bestselling book The Hidden Life of Trees, Peter Wohlleben established himself as a global advocate for forests and our relationship with trees. Now, Peter shares his famous imagination and storytelling style with children, asking surprising questions about trees with exciting quizzes, photographs, and hands-on activities to help even the most reluctant learners discover the answers. Did you know that trees have parents, and tree grandparents with wrinkles? That tree kids go to school for hundreds of years? That there is such a thing as the forest internet? And that trees make us healthy and strong. Sometimes, even trees get sick, but we can help them heal. Can You Hear the Trees Talking? shares the mysteries and magic of the forest in language kids will love and understand."
    },
    {
        "mmsId": "9952369250301401",
        "isbn": "9780316056618",
        "title": "Freewater.",
        "author": "Luqman-Dawson, Amina",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780316056618-L.jpg",
        "summary": "After fleeing the plantation where they were enslaved, siblings Ada and Homer discover the secret community of Freewater, and work with freeborn Sanzi to protect their new home from the encroaching dangers of the outside world."
    },
    {
        "mmsId": "9952369250601401",
        "isbn": "9781250834782",
        "title": "Roses, In The Mouth Of A Lion.",
        "author": "Rehman, Bushra",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781250834782-L.jpg",
        "summary": "\"In the vein of Dominicana and My Brilliant Friend, an unforgettable story about female friendship and queer love in a Pakistani-American community Razia Mirza grows up amid the wild grape vines and backyard sunflowers of Corona, Queens, with her best friend, Saima, by her side. But when a family rift drives the girls apart, Razia's idyllic childhood is shattered forever. In middle school, Razia befriends a new girl, Taslima, and they begin to chafe at the restrictions imposed on them in their tight-knit Pakistani Muslim community. Together, they embark on a series of small rebellions: listening to scandalous American music, wearing mini skirts, and cutting school to explore the city. Then Razia is accepted to a prestigious high school in Manhattan and the gulf between the person she wants to be and the daughter her parents expect widens. There, she meets beautiful, free-spirited Angela, Razia is attracted to her in a way that first confuses her and then blossoms into new understanding. But when their relationship is discovered by an Aunty in the community, Razia must choose between her family and her own future. Punctuated by both joy and loss, full '80s music and beloved novels, Roses, in the Mouth of a Lion is a new classic: a fiercely compassionate coming-of-age story of a girl struggling to reconcile her own heritage and faith with her desire to be true to herself\"--"
    },
    {
        "mmsId": "9952369250801401",
        "isbn": "9780593489635",
        "title": "How To Read Now: Essays.",
        "author": "Castillo, Elaine,",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780593489635-L.jpg",
        "summary": "“How to Read Now explores the politics and ethics of reading, and insists that we are capable of something better: a more engaged relationship not just with our fiction and our art, but with our buried and entangled histories.” “A book that doesn’t seek to shut down the current literary discourse so much as shake it up.” (The New York Times Book Review) Offering “its audience the opportunity to look past the simplicity we’re all too often spoon-fed into order to restore ourselves to chaos and complexity — a way of seeing and reading that demands so much more of us but offers even more in return.\" (Los Angeles Times) \"I gasped, shouted, and holler-laughed while reading these essays from the phenomenal Elaine Castillo. What powerful writing, what a rigorous mind. For as long as I live, I want to read anything Castillo writes, and you probably do, too.\" —R.O. Kwon, author of The Incendiaries How many times have we heard that reading builds empathy? That we can travel through books? How often have we were heard about the importance of diversifying our bookshelves? Or claimed that books saved our lives? These familiar words—beautiful, aspirational—are sometimes even true. But award-winning novelist Elaine Castillo has more ambitious hopes for our reading culture, and in this collection of linked essays, “she moves to wrest reading away from the cotton-candy aspirations of uniting people in empathetic harmony and reposition it as thornier, ultimately more rewarding work.” (Vulture) How to Read Now explores the politics and ethics of reading, and insists that we are capable of something better: a more engaged relationship not just with our fiction and our art, but with our buried and entangled histories. Smart, funny, galvanizing, and sometimes profane, Castillo attacks the stale questions and less-than-critical proclamations that masquerade as vital discussion: reimagining the cartography of the classics, building a moral case against the settler colonialism of lauded writers like Joan Didion, taking aim at Nobel Prize winners and toppling indie filmmakers, and celebrating glorious moments in everything from popular TV like The Watchmen to the films of Wong Kar-wai and the work of contemporary poets like Tommy Pico. At once a deeply personal and searching history of one woman’s reading life, and a wide-ranging and urgent intervention into our globalized conversations about why reading matters today, How to Read Now empowers us to embrace a more complicated, embodied form of reading, inviting us to acknowledge complicated truths, ignite surprising connections, imagine a more daring solidarity, and create space for a riskier intimacy—within ourselves, and with each other."
    },
    {
        "mmsId": "9952369250901401",
        "isbn": "9781668016138",
        "title": "Holly: A Novel.",
        "author": "King, Stephen, 1947-",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781668016138-L.jpg",
        "summary": "\"Stephen King's HOLLY marks the triumphant return of beloved King character Holly Gibney. Readers have witnessed Holly's gradual transformation from a shy and reclusive (but also brave and ethical) homebody in Mr. Mercedes to Bill Hodges's partner in Finders Keepers and End of Watch to a full-fledged, smart and occasionally tough private detective on her own in The Outsider and If It Bleeds. In this new novel, Holly once again claims the spotlight, and must face some of her most depraved adversaries yet. When Penny Dahl calls the Finders Keepers detective agency hoping for help locating her missing daughter, Holly is reluctant to accept the case. Her own mother has just died, and Holly is supposed to be taking time off. But something in Penny Dahl's desperate voice makes it impossible for Holly to turn her down. Mere blocks from where Bonnie Dahl disappeared live Professors Rodney and Emily Harris. They are the picture of bourgeois respectability: married octogenarians, devoted to each other, semi-retired lifelong academics. But they are harboring an unholy secret in their well-kept, book-lined home, one that may be related to Bonnie's disappearance. And it will prove nearly impossible to discover what they are up to: they are smart, they are patient, and they are ruthless. Holly must summon all her formidable talents to outhink and outmaneuver this brilliant and twisted pair in this chilling new masterwork from Stephen King\"--"
    },
    {
        "mmsId": "9952369251101401",
        "isbn": "9781684158324",
        "title": "Eat The Rich /",
        "author": "Gailey, Sarah, Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Fiction G138e 2022",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781684158324-L.jpg",
        "summary": "When the rich and powerful are literal cannibals, how can regular people avoid being on the menu? WELCOME TO CRESTFALL BLUFFS! With law school and her whole life ahead of her, Joey plans to spend the summer with her boyfriend Astor at his seemingly perfect family home. But beneath all the affluent perfection lies a dark, deadly rot… something all the locals live in quiet fear of. As summer lingers, Joey uncovers the macabre history of Crestfall Bluffs, and the ruthlessness and secrecy lying in wait behind the idyllic lives of the one percent. Who can Joey save? Who wants to be saved? And can she even survive to tell the tale? The bold, horrifying psychological thriller from Hugo Award-winning author Sarah Gailey (The Echo Wife, Magic For Liars) and artist Pius Bak (Firefly, The Magicians) with colorist Roman Titov and letterer Cardinal Rae. Collects Eat the Rich #1-5."
    },
    {
        "mmsId": "9952371352301401",
        "isbn": "9780062969828",
        "title": "The Blade Between : A Novel /",
        "author": "Miller, Sam J., Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Fiction M6511b 2020",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780062969828-L.jpg",
        "summary": "From Nebula Award winner Sam J. Miller comes a frightening and uncanny ghost story about a rapidly changing city in upstate New York and the mysterious forces that threaten it. Ronan Szepessy promised himself he'd never return to Hudson. The sleepy upstate town was no place for a restless gay photographer. But his father is ill and New York City's distractions have become too much for him. He hopes that a quick visit will help him recharge. Ronan reconnects with two friends from high school: Dom, his first love, and Dom's wife, Attalah. The three former misfits mourn what their town has become--overrun by gentrifiers and corporate interests. With friends and neighbors getting evicted en masse and a mayoral election coming up, Ronan and Attalah craft a plan to rattle the newcomers and expose their true motives. But in doing so, they unleash something far more mysterious and uncontainable. Hudson has a rich, proud history and, it turns out, the real-state developers aren't the only forces threatening its well-being: the spirits undergirding this once-thriving industrial town are enraged. Ronan's hijinks have overlapped with a bubbling up of hate and violence among friends and neighbors, and everything is spiraling out of control. Ronan must summon the very best of himself to shed his own demons and save the city he once loathed."
    },
    {
        "mmsId": "9952373352501401",
        "isbn": "9780063056763",
        "title": "Swim Team.",
        "author": "Christmas, Johnnie",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780063056763-L.jpg",
        "summary": "A splashy, contemporary middle grade graphic novel from bestselling comics creator Johnnie Christmas!"
    },
    {
        "mmsId": "9952373352601401",
        "isbn": "9780593310670",
        "title": "Me And The Boss: A Story About Mending And Love.",
        "author": "Edwards, Michelle",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780593310670-L.jpg",
        "summary": "CORETTA SCOTT KING ILLUSTRATOR HONOR AWARD WINNER CHARLOTTE ZOLOTOW AWARD WINNER All the highs and lows of having a bossy, protective, and loving older sibling are depicted in this heartwarming picture book by a critically acclaimed author and award-winning illustrator. Meet Lee, a little boy who won't give up until he learns how to sew, and Zora, the sister who watches him try--and ultimately succeed! \"I know big sisters. Zora, the boss, she's mine,\" explains Lee as he and Zora head to the library, where Mrs. C is teaching the children how to sew. Though Zora sews a beautiful flower on her cloth square, little Lee makes a mess out of the half-moon he is trying to stitch. That night, when he can't sleep, he gives sewing another try...and succeeds, even mending the hole in his pants pocket! The next morning, he sneaks into Zora's room and sews the ear back on Bess, her stuffed bear. When Zora discovers Bess, she wraps Lee in her special big sister hug--for just a moment--and then is back to being the boss once again. National Jewish Book Award-winning author Michelle Edwards and Coretta Scott King-John Steptoe Award-winning illustrator April Harrison create a funny, oh-so-true portrait of a brother and sister’s relationship in this winning picture book."
    },
    {
        "mmsId": "9952373352701401",
        "isbn": "9780593466575",
        "title": "When Women Were Dragons : A Novel /",
        "author": "Barnhill, Kelly Regan, Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-06",
        "callNo": "Fiction B2623w 2022",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780593466575-L.jpg",
        "summary": "A rollicking feminist tale set in 1950s America where thousands of women have spontaneously transformed into dragons, exploding notions of a woman’s place in the world and expanding minds about accepting others for who they really are. • The first adult novel by the Newbery award-winning author of The Girl Who Drank the Moon Alex Green is a young girl in a world much like ours, except for its most seminal event: the Mass Dragoning of 1955, when hundreds of thousands of ordinary wives and mothers sprouted wings, scales, and talons; left a trail of fiery destruction in their path; and took to the skies. Was it their choice? What will become of those left behind? Why did Alex’s beloved aunt Marla transform but her mother did not? Alex doesn’t know. It’s taboo to speak of. Forced into silence, Alex nevertheless must face the consequences of this astonishing event: a mother more protective than ever; an absentee father; the upsetting insistence that her aunt never even existed; and watching her beloved cousin Bea become dangerously obsessed with the forbidden. In this timely and timeless speculative novel, award-winning author Kelly Barnhill boldly explores rage, memory, and the tyranny of forced limitations. When Women Were Dragons exposes a world that wants to keep women small—their lives and their prospects—and examines what happens when they rise en masse and take up the space they deserve."
    },
    {
        "mmsId": "9952178876001401",
        "isbn": "9781583225813",
        "title": "Are Prisons Obsolete? /",
        "author": "Davis, Angela Y. 1944- (Angela Yvonne),",
        "recStatus": "Yes",
        "recDate": "2023-10-02",
        "callNo": "365.973 D261a 2003",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781583225813-L.jpg",
        "summary": "With her characteristic brilliance, grace and radical audacity, Angela Y. Davis has put the case for the latest abolition movement in American life: the abolition of the prison. As she quite correctly notes, American life is replete with abolition movements, and when they were engaged in these struggles, their chances of success seemed almost unthinkable. For generations of Americans, the abolition of slavery was sheerest illusion. Similarly,the entrenched system of racial segregation seemed to last forever, and generations lived in the midst of the practice, with few predicting its passage from custom. The brutal, exploitative (dare one say lucrative?) convict-lease system that succeeded formal slavery reaped millions to southern jurisdictions (and untold miseries for tens of thousands of men, and women). Few predicted its passing from the American penal landscape. Davis expertly argues how social movements transformed these social, political and cultural institutions, and made such practices untenable. In Are Prisons Obsolete?, Professor Davis seeks to illustrate that the time for the prison is approaching an end. She argues forthrightly for \"decarceration\", and argues for the transformation of the society as a whole."
    },
    {
        "mmsId": "9952369251501401",
        "isbn": "9780786966639",
        "title": "Player's Handbook.",
        "author": "",
        "recStatus": "Yes",
        "recDate": "2023-10-02",
        "callNo": "793.93 D916p 2014",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780786966639-L.jpg",
        "summary": "No summary."
    },
    {
        "mmsId": "9952369251701401",
        "isbn": "9780786965618",
        "title": "Monster Manual.",
        "author": "",
        "recStatus": "Yes",
        "recDate": "2023-10-02",
        "callNo": "793.93 D916ma 2014",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780786965618-L.jpg",
        "summary": "Fill your Dungeons & Dragons games with deadly monsters from the Monster Manual. The Monster Manual teaches you how to how to fill your Dungeons & Dragons games with monsters—how to populate the game with pesky goblins and mighty dragons for players to battle or beguile, outwit or outrun. Inside the Monster Manual you’ll find more than 150 classic D&D creatures, with vivid illustrations and rich descriptions to help breathe life into your zombies and liches. “…What if I told you about the best book of monsters ever? The 5E Monster Manual just might be the one...”—Ed Grabianowski, io9.Gizmodo.com “D&D acolytes are everywhere...Tech workers from Silicon Valley to Brooklyn have long-running campaigns, and the showrunners and the novelist behind ‘Game of Thrones’ have all been Dungeon Masters.”—Neima Jahromi, The New Yorker • The Monster Manual is one of the three main Dungeons & Dragons books, along with the Player’s Handbook and the Dungeon Master’s Guide. It’s an essential resource for Dungeon Masters to use in populating any type of challenge they might contrive for their players. • From an angel’s wingspan to the vacant eyes of a zombie beholder, the Monster Manual includes more than 150 creatures illustrated in vivid color, with more than 400 quick reference tables to help you bring them to life with ease. • Rich descriptions of each monster help trigger your imagination. From the familiar (“vampires hate sunlight”) to the arcane (“what color is the vapor from a gorgon’s nose?”), the Monster Manual helps inspire your decisions and keep the game flowing smoothly. • In Dungeons & Dragons, you and your friends coauthor your own legend. Guided by a Dungeon Master, you create characters and play their roles in a story, rolling dice and navigating maps as you unfold a tale as limitless as your imagination. • Dungeons & Dragons is the world’s greatest roleplaying game. Created in 1974, D&D transformed gaming culture by blending traditional fantasy with miniatures and wargaming."
    },
    {
        "mmsId": "9952369251801401",
        "isbn": "9781611720778",
        "title": "Just Enough : Lessons From Japan For Sustainable Living, Architecture, And Design /",
        "author": "Brown, Azby, 1956- Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-02",
        "callNo": "333.72095 B8773 2022",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781611720778-L.jpg",
        "summary": "How the mindset of traditional Japanese society can guide our own efforts to lead a green lifestyle today."
    },
    {
        "mmsId": "9952369251901401",
        "isbn": "9780786965625",
        "title": "Dungeon Master's Guide.",
        "author": "",
        "recStatus": "Yes",
        "recDate": "2023-10-02",
        "callNo": "D916d 2014",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780786965625-L.jpg",
        "summary": "Weave legendary stories in the world’s greatest roleplaying game. All you need to run a Dungeons & Dragons game is your imagination, some dice, and this book. The Dungeon Master’s Guide teaches you how to how to run D&D adventures for your players— how to invent monsters for them to fight, mysteries for them to solve, and fantasy worlds for them to explore. “[The Dungeon Master’s Guide is] the one book to rule them all, the most comprehensive and powerful set of resources needed to run a game of D&D. . .” —Charlie Hall, Polygon.com “D&D acolytes are everywhere...Tech workers from Silicon Valley to Brooklyn have long-running campaigns, and the showrunners and the novelist behind ‘Game of Thrones’ have all been Dungeon Masters.”—Neima Jahromi, The New Yorker • The Dungeon Master’s Guide is one of the three main Dungeons & Dragons books, along with the Player’s Handbook and Monster Manual. It’s a reference used by the Dungeon Master (the game’s narrator) to create adventures—to run Dungeons & Dragons games and fill them with characters and stories. • The Dungeon Master’s Guide (DMG) is full of tools to help you immerse players in the game. What’s the demon lord’s secret weakness? Are the orcish invaders a criminal enterprise, or traitorous allies? Dozens of tables throughout the book help inspire your decisions and keep the game flowing smoothly. • In the Dungeon Master’s Guide (DMG), even the tables tell tales. A legendary sword takes five decades to craft. Who created it, and why? A tavern-crawling gnome has an eye twitch. How did she get it, and when? In every detail is an architecture for narrative—and the Dungeon Master’s Guide has all the tools you need to flesh it out with ease. • In Dungeons & Dragons, you and your friends coauthor your own legend. Guided by a Dungeon Master, you create characters and play their roles in a story, rolling dice and navigating maps as you unfold a tale as limitless as your imagination. • Dungeons & Dragons is the world’s greatest roleplaying game. Created in 1974, D&D transformed gaming culture by blending traditional fantasy with miniatures and wargaming."
    },
    {
        "mmsId": "9952369252001401",
        "isbn": "9780316592598",
        "title": "My Head Has A Bellyache : And More Nonsense For Mischievous Kids And Immature Grown-Ups /",
        "author": "Harris, Chris, 1970- Author.",
        "recStatus": "Yes",
        "recDate": "2023-10-02",
        "callNo": "811.6 H3135m 2023",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780316592598-L.jpg",
        "summary": "\"A witty, illustrated collection of humorous (and sometimes even heartwarming) poems and nonsense inspired by the absurdities of everyday life\"--"
    },
    {
        "mmsId": "9952369252201401",
        "isbn": "9781250800152",
        "title": "Magic: A History: From Alchemy To Witchcraft, From The Ice Age To The Present.",
        "author": "Gosden, Chris",
        "recStatus": "Yes",
        "recDate": "2023-10-02",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781250800152-L.jpg",
        "summary": "An Oxford professor of archaeology explores the unique history of magic—the oldest and most neglected strand of human behavior and its resurgence today Three great strands of belief run through human history: Religion is the relationship with one god or many gods, masters of our lives and destinies. Science distances us from the world, turning us into observers and collectors of knowledge. And magic is direct human participation in the universe: we have influence on the world around us, and the world has influence on us. Over the last few centuries, magic has developed a bad reputation—thanks to the unsavory tactics of shady practitioners, and to a successful propaganda campaign on the part of religion and science, which denigrated magic as backward, irrational, and “primitive.” In Magic, however, the Oxford professor of archaeology Chris Gosden restores magic to its essential place in the history of the world—revealing it to be an enduring element of human behavior that plays an important role for individuals and cultures. From the curses and charms of ancient Greek, Roman, and Jewish magic, to the shamanistic traditions of Eurasia, indigenous America, and Africa; from the alchemy of the Renaissance to the condemnation of magic in the colonial period and the mysteries of modern quantum physics—Gosden’s startling, fun, and colorful history supplies a missing chapter of the story of our civilization. Drawing on decades of research around the world—touching on the first known horoscope, a statue ordered into exile, and the mystical power of tattoos—Gosden shows what magic can offer us today, and how we might use it to rethink our relationship with the world. Magic is an original, singular, and sweeping work of scholarship, and its revelations will leave a spell on the reader."
    },
    {
        "mmsId": "9952372934001401",
        "isbn": "9781138055278",
        "title": "Readings For Diversity And Social Justice /",
        "author": "",
        "recStatus": "Yes",
        "recDate": "2023-10-02",
        "callNo": "305.80097 R2874 2018",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781138055278-L.jpg",
        "summary": "For nearly 20 years, Readings for Diversity and Social Justice has been the trusted, leading anthology to cover a wide range of social oppressions from a social justice standpoint. With full sections dedicated to racism, religious oppression, classism, ableism, youth and elder oppression, as well as an integrative section dedicated to sexism, heterosexism, and transgender oppression, this bestselling text goes far beyond the range of traditional readers. New essay selections in each section of this fourth edition have been carefully chosen to keep topic coverage timely and readings accessible and engaging for students. The interactions among these topics are highlighted throughout to stress the interconnections among oppressions in everyday life. A Table of Intersections leads you to selections not in the section dedicated to an issue. Retaining the key features and organization that has made Readings for Diversity and Social Justice an indispensable text for teaching issues of social justice while simultaneously updating and expanding its coverage, this new edition features: Over 40 new selections considering current topics and events such as the Black Lives Matter movement, workplace immigration raids, gentrification, wealth inequality, the disability rights of prisoners and inmates, and the Keystone XL pipeline protests. An updated companion website with additional resources and short classroom-friendly videos that further complement the readings in each section. A holistic approach to sexism, gay, lesbian, trans and gender-queer oppression that challenges widely-held assumptions about the usual practice of separating analyses of sex and gender binaries. A more optimistic focus on the role of social justice at all levels of society, whether personal, institutional local, or global, and the intersections among them. Offering over 140 selections from some of the foremost scholars in a wide range of fields, Readings for Diversity and Social Justice is the indispensable volume for every student, teacher, and social justice advocate."
    },
    {
        "mmsId": "9952353852601401",
        "isbn": "9781803363523",
        "title": "Ghibli Recipe Book.",
        "author": "Vilanova, Thibaud",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781803363523-L.jpg",
        "summary": "Create 40 delicious dishes from your favourite Studio Ghibli films! 40 recipes inspired by the masterpieces of Studio Ghibli: My Neighbour Totoro, Spirited Away, Princess Mononoke, Howl's Moving Castle... Dive into the dreamlike worlds of these animated films and enjoy the recipes created by Thibaud Villanova, a specialist in the cuisine of the imagination."
    },
    {
        "mmsId": "9952356751101401",
        "isbn": "9780807766132",
        "title": "Native Presence And Sovereignty In College: Sustaining Indigenous Weapons To Defeat Systemic Monster",
        "author": "Tachine, Amanda R",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780807766132-L.jpg",
        "summary": "What is at stake when our young people attempt to belong to a college environment that reflects a world that does not want them for who they are? In this compelling book, Navajo scholar Amanda Tachine takes a personal look at 10 Navajo teenagers, following their experiences during their last year in high school and into their first year in college. It is common to think of this life transition as a time for creating new connections to a campus community, but what if there are systemic mechanisms lurking in that community that hurt Native students' chances of earning a degree? Tachine describes these mechanisms as systemic monsters and shows how campus environments can be sites of harm for Indigenous students due to factors that she terms monsters' sense of belonging, namely assimilating, diminishing, harming the worldviews of those not rooted in White supremacy, heteropatriarchy, capitalism, racism, and Indigenous erasure. This book addresses the nature of those monsters and details the Indigenous weapons that students use to defeat them. Rooted in love, life, sacredness, and sovereignty, these weapons reawaken students' presence and power. Book Features: Introduces an Indigenous methodological approach called story rug that demonstrates how research can be expanded to encompass all our senses. Weaves together Navajo youths' stories of struggle and hope in educational settings, making visible systemic monsters and Indigenous weaponry. Draws from Navajo knowledge systems as an analytic tool to connect history to present and future realities. Speaks to the contemporary situation of Native peoples, illuminating the challenges that Native students face in making the transition to college. Examines historical and contemporary realities of Navajo systemic monsters, such as the financial hardship monster, deficit (not enough) monster, failure monster, and (in)visibility monster. Offers insights for higher education institutions that are seeking ways to create belonging for diverse students."
    },
    {
        "mmsId": "9952356751601401",
        "isbn": "9781737277521",
        "title": "Punks: New & Selected Poems.",
        "author": "Keene, John, 1965-",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781737277521-L.jpg",
        "summary": "A landmark collection of poetry by acclaimed fiction writer, translator, and MacArthur Fellow John Keene, PUNKS: NEW & SELECTED POEMS is a generous treasury in seven sections that spans decades and includes previously unpublished and brand new work. With depth and breadth, PUNKS weaves together historic narratives of loss, lust, and love. The many voices that emerge in these poems--from historic Black personalities, both familial and famous, to the poet's friends and lovers in gay bars and bedrooms--form a cast of characters capable of addressing desire, oppression, AIDS, and grief through sorrowful songs that \"we sing as hard as we live.\" At home in countless poetic forms, PUNKS reconfirms John Keene as one of the most important voices in contemporary poetry. \"John Keene's PUNKS is utterly brilliant. The range, vision, depth and humanity he brings to the page are as galactic as Banneker's astral wanderings, as crisp as the chordal cutting of a searching horn, as courageous and small as a nose wide open. Keene's masterfully inventive inquiry of self and history is queered, Blackened, and joyously thick with multitudes of voice and valence. Amen to this exploration!\"--Tyehimba Jess Poetry. African & African American Studies. LGBTQIA Studies."
    },
    {
        "mmsId": "9952356752001401",
        "isbn": "9781338617566",
        "title": "Heartstopper.",
        "author": "Oseman, Alice, Author, Artist.",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Fiction O817h v.4",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781338617566-L.jpg",
        "summary": "Boy meets boy. Boys become friends. Boys fall in love. A sweet and charming coming-of-age story that explores friendship, love, and coming out. This edition features beautiful two-color artwork. Absolutely delightful. Sweet, romantic, kind. Beautifully paced. I loved this book. -- Rainbow Rowell, author of Carry On Shy and softhearted Charlie Spring sits next to rugby player Nick Nelson in class one morning. A warm and intimate friendship follows, and that soon develops into something more for Charlie, who doesn't think he has a chance. But Nick is struggling with feelings of his own, and as the two grow closer and take on the ups and downs of high school, they come to understand the surprising and delightful ways in which love works."
    },
    {
        "mmsId": "9952356752201401",
        "isbn": "9780062869951",
        "title": "Ancestor Approved: Intertribal Stories For Kids.",
        "author": "Smith, Cynthia Leitich",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780062869951-L.jpg",
        "summary": "Edited by award-winning and bestselling author Cynthia Leitich Smith, this collection of intersecting stories by both new and veteran Native writers bursts with hope, joy, resilience, the strength of community, and Native pride. Native families from Nations across the continent gather at the Dance for Mother Earth Powwow in Ann Arbor, Michigan. In a high school gym full of color and song, people dance, sell beadwork and books, and celebrate friendship and heritage. Young protagonists will meet relatives from faraway, mysterious strangers, and sometimes one another (plus one scrappy rez dog). They are the heroes of their own stories. Featuring stories and poems by: Joseph Bruchac Art Coulson Christine Day Eric Gansworth Carole Lindstrom Dawn Quigley Rebecca Roanhorse David A. Robertson Andrea L. Rogers Kim Rogers Cynthia Leitich Smith Monique Gray Smith Traci Sorell, Tim Tingle Erika T. Wurth Brian Young In partnership with We Need Diverse Books"
    },
    {
        "mmsId": "9952363887501401",
        "isbn": "9780593308462",
        "title": "On Top Of Glass : My Stories As A Queer Girl In Figure Skating /",
        "author": "Manta, Karina,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780593308462-L.jpg",
        "summary": "An insightful memoir from a figure skating champion about her life as a bisexual professional athlete, perfect for readers of Fierce by Aly Raisman and Forward by Abby Wambach. Karina Manta has had a busy few years: Not only did she capture the hearts of many with her fan-favorite performance at the U.S. Figure Skating Championships, she also became the first female figure skater on Team USA to come out as queer. Her Modern Love essay \"I Can't Hate My Body if I Love Hers\" was published in the New York Times, and then she joined the circus--Cirque du Soleil's on-ice show, AXEL. Karina's memoir covers these experiences and much more. Attending a high school with 4,000 students, you'd expect to know more than two openly gay students, but Karina didn't meet an out-lesbian until she was nearly seventeen--let alone any other kind of queer woman. But this isn't just a story about her queerness. It's also a story about her struggle with body image in a sport that prizes delicate femininity. It's a story about panic attacks, and first crushes, and all the crushes that followed, and it's a story about growing up, feeling different than everybody around her and then realizing that everyone else felt different too."
    },
    {
        "mmsId": "9952363887701401",
        "isbn": "9780593203415",
        "title": "One Life /",
        "author": "Rapinoe, Megan,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780593203415-L.jpg",
        "summary": "Adapted for young readers! Join two-time Women's World Cup champion, Olympic gold medalist, and trailblazing activist Megan Rapinoe in the fight for equality and justice in this middle grade adaptation of her New York Times bestselling memoir, One Life. You know Megan Rapinoe as an international soccer superstar! She’s also a fierce activist, boldly speaking out about issues of equality and justice—from LGBTQ rights to the equal pay movement to Black Lives Matter. In this adaptation for middle school readers of her memoir One Life, get to know Megan: from her childhood in a small California town where she learned to play soccer and how to fight for social justice; through high school, college and beyond; to 2016 when she became the first high-profile white athlete to take a knee in support of Colin Kaepernik, and also suing the United States Soccer Federation along with her teammates over gender discrimination. Using stories from her own life and career, Rapinoe discusses the responsibility we have to speak up. In this edition specifically for young readers, she reveals the impact everyone, even kids, can have on their communities and how kids can get involved in making the world a better place."
    },
    {
        "mmsId": "9952363888501401",
        "isbn": "9780593113523",
        "title": "Ikenga /",
        "author": "Okorafor, Nnedi,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780593113523-L.jpg",
        "summary": "Nnedi Okorafor's acclaimed first novel for middle grade readers introduces a boy who can access super powers with the help of the magical Ikenga. Nnamdi's father was a good chief of police, perhaps the best Kalaria had ever had. He was determined to root out the criminals that had invaded the town. But then he was murdered, and most people believed the Chief of Chiefs, most powerful of the criminals, was responsible. Nnamdi has vowed to avenge his father, but he wonders what a twelve-year-old boy can do. Until a mysterious nighttime meeting, the gift of a magical object that enables super powers, and a charge to use those powers for good changes his life forever. How can he fulfill his mission? How will he learn to control his newfound powers? Award-winning Nnedi Okorafor, acclaimed for her Akata novels, introduces a new and engaging hero in her first novel for middle grade readers set against a richly textured background of contemporary Nigeria."
    },
    {
        "mmsId": "9952363889101401",
        "isbn": "9780525656135",
        "title": "Orange World : And Other Stories /",
        "author": "Russell, Karen,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780525656135-L.jpg",
        "summary": "\"From the Pulitzer finalist and universally beloved author of the New York Times best sellers Swamplandia! and Vampires in the Lemon Grove, a stunning new collection of short fiction that showcases her extraordinary gifts of language and imagination\"--"
    },
    {
        "mmsId": "9952363889301401",
        "isbn": "9780525516255",
        "title": "Hot Dog Girl /",
        "author": "Dugan, Jennifer,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780525516255-L.jpg",
        "summary": "A fresh and funny contemporary YA rom-com about teens working as costumed characters in a local amusement part. \"I'm wrecked with love for this funny, joyful, bighearted book.\" --Becky Albertalli, bestselling author of Simon vs. the Homo Sapiens Agenda Elouise (Lou) Parker is determined to have the absolute best, most impossibly epic summer of her life. There are just a few things standing in her way: She's landed a job at Magic Castle Playland . . . as a giant dancing hot dog. Her crush, the dreamy diving pirate Nick, already has a girlfriend, who is literally the princess of the park. But Lou's never liked anyone, guy or otherwise, this much before, and now she wants a chance at her own happily ever after. Her best friend, Seeley, the carousel operator, has always been up for anything, but she's decidedly not on board when it comes to Lou's quest to set her up with the perfect girl or Lou's scheme to get close to Nick. And it turns out that this will be their last summer at Magic Castle Playland--ever--unless she can find a way to stop it from closing. Jennifer Dugan's sparkling debut coming-of-age queer romance stars a princess, a pirate, a hot dog, and a carousel operator who find love--and themselves--in unexpected people and unforgettable places. \"Both classic and new, hysterical and heartfelt, and packed with all the awesomeness and awkwardness of first love, first job, and the painful thrill of growing up.\" --Mackenzi Lee, bestselling author of The Gentleman's Guide to Vice and Virtue"
    },
    {
        "mmsId": "9952363889401401",
        "isbn": "9780525515609",
        "title": "Sugar Town Queens /",
        "author": "Nunn, Malla,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780525515609-L.jpg",
        "summary": "From Los Angeles Times Book Prize Award winner and Edgar Award nominee Malla Nunn comes a stunning portrait of a family divided and a powerful story of how friendship saves and heals. When Amandla wakes up on her fifteenth birthday, she knows it's going to be one of her mother's difficult days. Her mother has had another vision. This one involves Amandla wearing a bedsheet loosely stitched as a dress. An outfit, her mother says, is certain to bring Amandla's father back home, as if he were the prince and this was the fairytale ending their family was destined for. But in truth, Amandla's father has long been gone--since before Amandla was born--and even her mother's memory of him is hazy. In fact, many of her mother's memories from before Amandla was born are hazy. It's just one of the many reasons people in Sugar Town give them strange looks--that and the fact her mother is white and Amandla is Black. When Amandla finds a mysterious address in the bottom of her mother's handbag along with a large amount of cash, she decides it's finally time to get answers about her mother's life. What she discovers will change the shape and size of her family forever. But with her best friends at her side, Amandla is ready to take on family secrets and the devil himself. These Sugar Town queens are ready to take over the world to expose the hard truths of their lives."
    },
    {
        "mmsId": "9952363889701401",
        "isbn": "9780375970504",
        "title": "The Fitzosbornes At War /",
        "author": "Cooper, Michelle,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780375970504-L.jpg",
        "summary": "Originally published: North Sydney, NSW: Random House Australia, 2012."
    },
    {
        "mmsId": "9952363890101401",
        "isbn": "9780375958656",
        "title": "The Fitzosbornes In Exile /",
        "author": "Cooper, Michelle,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780375958656-L.jpg",
        "summary": "In January 1937, as Sophia FitzOsborne continues to record in her journal, the members of Montmaray's royal family are living in luxurious exile in England but, even as they participate in the social whirl of London parties and balls, they remain determined to free their island home from the occupying Germans despite growing rumors of a coming war that might doom their country forever."
    },
    {
        "mmsId": "9952363890201401",
        "isbn": "9781984815248",
        "title": "My Eyes Are Up Here /",
        "author": "Zimmermann, Laura,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781984815248-L.jpg",
        "summary": "My Eyes Are Up Here is a razor-sharp debut about a girl struggling to rediscover her sense of self in the year after her body decided to change all the rules. If Greer Walsh could only live inside her head, life would be easier. She’d be able to focus on excelling at math or negotiating peace talks between her best friend and . . . everyone else. She wouldn’t spend any time worrying about being the only Kennedy High student whose breasts are bigger than her head. But you can’t play volleyball inside your head. Or go to the pool. Or have confusingly date-like encounters with the charming new boy. You need an actual body for all of those things. And Greer is entirely uncomfortable in hers. Hilarious and heartbreakingly honest, My Eyes Are Up Here is a story of awkwardness and ferocity, of imaginary butterflies and rock-solid friends. It’s the story of a girl finding her way out of her oversized sweatshirt and back into the real world."
    },
    {
        "mmsId": "9952363890401401",
        "isbn": "9781984814630",
        "title": "Maya And The Robot /",
        "author": "Ewing, Eve L.,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781984814630-L.jpg",
        "summary": "From award-winning author Eve L. Ewing comes an illustrated middle grade novel about a forgotten homemade robot who comes to life just when aspiring fifth-grade scientist Maya needs a friend -- and a science fair project. Maya's nervous about fifth grade. She tries to keep calm by reminding herself she knows what to expect. But then she learns that this year won't be anything like the last. For the first time since kindergarten, her best friends Jada and MJ are placed in a different class without her, and introverted Maya has trouble making new friends. She tries to put on a brave face since they are in fifth grade now, but Maya is nervous! Just when too much seems to be changing, she finds a robot named Ralph in the back of Mr. Mac's convenience store closet. Once she uses her science skills to get him up and running, a whole new world of connection opens up as Ralph becomes a member of her family and Maya begins to step into her power. In this touching novel, Eve L. Ewing melds together a story about community, adapting to change, and the magic of ingenuity that reminds young readers that they can always turn to their own curiosity when feeling lost."
    },
    {
        "mmsId": "9952363891201401",
        "isbn": "9780358129400",
        "title": "On The Horizon /",
        "author": "Lowry, Lois,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780358129400-L.jpg",
        "summary": "From two-time Newbery medalist and living legend Lois Lowry comes a moving account of the lives lost in two of WWII's most infamous events: Pearl Harbor and Hiroshima. With evocative black-and-white illustrations by SCBWI Golden Kite Award winner Kenard Pak. Lois Lowry looks back at history through a personal lens as she draws from her own memories as a child in Hawaii and Japan, as well as from historical research, in this stunning work in verse for young readers. On the Horizon tells the story of people whose lives were lost or forever altered by the twin tragedies of Pearl Harbor and Hiroshima. Based on the lives of soldiers at Pearl Harbor and civilians in Hiroshima,On the Horizon contemplates humanity and war through verse that sings with pain, truth, and the importance of bridging cultural divides. This masterful work emphasizes empathy and understanding in search of commonality and friendship, vital lessons for students as well as citizens of today's world. Kenard Pak's stunning illustrations depict real-life people, places, and events, making for an incredibly vivid return to our collective past. In turns haunting, heartbreaking, and uplifting,On the Horizonwill remind readers of the horrors and heroism in our past, as well as offer hope for our future."
    },
    {
        "mmsId": "9952363892701401",
        "isbn": "9780063038837",
        "title": "Meet Cute Diary /",
        "author": "Lee, Emery,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780063038837-L.jpg",
        "summary": "Felix Ever After meets Becky Albertalli in this swoon-worthy, heartfelt rom-com about how a transgender teen's first love challenges his ideas about perfect relationships. Noah Ramirez thinks he's an expert on romance. He has to be for his popular blog, the Meet Cute Diary, a collection of trans happily ever afters. There's just one problem--all the stories are fake. What started as the fantasies of a trans boy afraid to step out of the closet has grown into a beacon of hope for trans readers across the globe. When a troll exposes the blog as fiction, Noah's world unravels. The only way to save the Diary is to convince everyone that the stories are true, but he doesn't have any proof. Then Drew walks into Noah's life, and the pieces fall into place: Drew is willing to fake-date Noah to save the Diary. But when Noah's feelings grow beyond their staged romance, he realizes that dating in real life isn't quite the same as finding love on the page. In this charming novel by Emery Lee, Noah will have to choose between following his own rules for love or discovering that the most romantic endings are the ones that go off script."
    },
    {
        "mmsId": "9952363892901401",
        "isbn": "9780063024793",
        "title": "Excuse Me While I Ugly Cry /",
        "author": "Goffney, Joya,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780063024793-L.jpg",
        "summary": "Excuse Me While I Ugly Cry by debut author Joya Goffney is an own voices story of an overly enthusiastic list maker who is blackmailed into completing a to-do list of all her worst fears. It's a heartfelt, tortured, contemporary YA high school romance. Fans of Jenny Han's To All the Boys I've Loved Before and Kristina Forest's I Wanna Be Where You Are will love the juicy secrets and leap-off-the-page sexual tension. Quinn keeps lists of everything--from the days she's ugly cried, to \"Things That I Would Never Admit Out Loud\" and all the boys she'd like to kiss. Her lists keep her sane. By writing her fears on paper, she never has to face them in real life. That is, until her journal goes missing . . . Then an anonymous account posts one of her lists on Instagram for the whole school to see and blackmails her into facing seven of her greatest fears, or else her entire journal will go public. Quinn doesn't know who to trust. Desperate, she teams up with Carter Bennett--the last known person to have her journal--in a race against time to track down the blackmailer. Together, they journey through everything Quinn's been too afraid to face, and along the way, Quinn finds the courage to be honest, to live in the moment, and to fall in love."
    },
    {
        "mmsId": "9952363893501401",
        "isbn": "9780062985651",
        "title": "The Mending Summer /",
        "author": "Standish, Ali,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780062985651-L.jpg",
        "summary": "Perfect for fans of Orphan Island and Wishtree, The Mending Summer is the next stunning middle grade novel from Ali Standish--author of the Carnegie Medal nominee The Ethan I Was Before and August Isle, Bad Bella, and How to Disappear Completely--about a girl who is struggling to deal with her father's alcoholism when she discovers an enchanted lake... Some summers are meant to break your heart. Others to mend it. Every once in a while, a summer rolls around that does both. For Georgia, this summer is shaping up to be a big disappointment. Mama is busy studying for her biology degree. Daddy is working nights, and often the man who comes home isn't Daddy. He's a man who looks like Daddy, but walks a little wobbly. Who sounds like Daddy, but sings a little too loud. Georgia calls him the Shadow Man. So now, instead of riding horses with her friends at camp, Georgia is sent off to the country to stay with her mysterious great-aunt for the summer to avoid her parents' fighting. There, a lonely Georgia meets a mysterious friend named Angela and together, they discover a magical lake--one that can make wishes come true. At first, the lake offers Georgia a thrilling escape from her worries and hope that she can use its magic to heal her family. But as things grow worse at home, a troubled boy appears at the lake and the wishes threaten to spiral out of control . . . Award-winning author Ali Standish explores the courage it takes to piece your heart back together again when those closest to you break it."
    },
    {
        "mmsId": "9952363894501401",
        "isbn": "9780062945983",
        "title": "Witches Steeped In Gold /",
        "author": "Smart, Ciannon,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780062945983-L.jpg",
        "summary": "\"Two enemy witches must enter into a deadly alliance to take down a tyrant who threatens both their worlds-with unpredictable results\"--"
    },
    {
        "mmsId": "9952363894601401",
        "isbn": "9781547609772",
        "title": "The Vanquishers /",
        "author": "Bayron, Kalynn,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781547609772-L.jpg",
        "summary": "Bestselling author Kalynn Bayron brings readers the world of The Vanquishers, where vampires were history . . . until now."
    },
    {
        "mmsId": "9952363894701401",
        "isbn": "9780062937063",
        "title": "The House That Wasn't There /",
        "author": "Arnold, Elana K.,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780062937063-L.jpg",
        "summary": "No summary."
    },
    {
        "mmsId": "9952363894801401",
        "isbn": "9781547606078",
        "title": "Every Body Shines : Sixteen Stories About Living Fabulously Fat /",
        "author": "",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781547606078-L.jpg",
        "summary": "\"Sixteen stories celebrating fat teens with bodies of many shapes and from many communities, cultures, races, genders, and orientations in contemporary settings as well as fictional worlds\"--"
    },
    {
        "mmsId": "9952364021401401",
        "isbn": "9781536214116",
        "title": "Sunshine /",
        "author": "Bauer, Marion Dane,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781536214116-L.jpg",
        "summary": "For most of Ben's life, he has been a kid without a mom. He has his dad, who knows Ben doesn't like oatmeal and always hugs Ben before bed. And he has Sunshine, his loyal little dog, who is never far from his side. But his mom, who left when he was young, has just been a story, faint in his memory. Now he's about to spend a whole week with her on her remote island in the middle of the northern Minnesota wilderness. Though he's nervous about bears and outhouses and what his mom will think of Sunshine, Ben has a plan. When a fire threatens his mom's island, Ben finally realizes everything he's been trying to forget and learns how to forgive his mom - and himself."
    },
    {
        "mmsId": "9952364021501401",
        "isbn": "9781536213652",
        "title": "The Secret Starling /",
        "author": "Eagle, Judith,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781536213652-L.jpg",
        "summary": "A tattered ballet slipper found under the floorboards of Braithwaite Manor may be the key to Clara’s sinister family secrets in this delightful, lightly Gothic mystery for fans of Maryrose Wood and Claire Legrand. Clara Starling lives a life of dull rules, deadly routine, and flavorless meals under her cold uncle's strict regime—until the day Uncle disappears, leaving Clara alone in his old mansion. When streetwise orphan Peter and his rescue cat arrive unexpectedly, the children seize the chance to live by their own rules. But when the pair’s wild romps through the halls of Braithwaite Manor reveal a single, worn ballet slipper, they are hurled into a mystery that will lead to London’s glittering Royal Opera House and the unraveling of twisted Starling family secrets of poison, passion, and murder. Diabolical villains, plucky orphans, and glamorous ballet stars populate this absorbing adventure with a classic feel."
    },
    {
        "mmsId": "9952364022201401",
        "isbn": "9781536207118",
        "title": "Polo Cowboy : A Novel /",
        "author": "Neri, Greg,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781536207118-L.jpg",
        "summary": "\"When Cole moves in with his dad, Harp, he thinks life will be sweet--just him and his horse, Boo, hanging out with Philadelphia's urban cowboys. But when Harp says he has to get a job, Cole winds up as a stable hand for the polo team at George Washington Military Academy, where the players are rich, white, and stuck-up--all except Ruthie, the team's first and only girl, who's determined to show the others she can beat them at their own game. As Cole and Ruthie become friends--and maybe more--he starts imagining his future, maybe even at the academy. But between long workdays, arrogant polo players, and a cousin trying to pull Cole into his dangerous business, that future seems remote. Will Cole find the courage to stand and be seen in a world determined to keep him out? With striking illustrations by Jesse Joshua Watson, celebrated author G. Neri's novel weaves themes of tenacity and community into a rousing sports story inspired by Philadelphia's real-life urban cowboys and polo players. How does a Black kid from North Philly wind up playing polo? The much-anticipated sequel to Ghetto Cowboy, now a major motion picture starring Idris Elba and Stranger Things's Caleb McLaughlin.\"--"
    },
    {
        "mmsId": "9952364022401401",
        "isbn": "9781536201819",
        "title": "Franklin Endicott And The Third Key /",
        "author": "Dicamillo, Kate,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781536201819-L.jpg",
        "summary": "The latest tale from Deckawoo Drive—and New York Times best-selling creators Kate DiCamillo and Chris Van Dusen—is a balm for young worrywarts facing the unknown. Welcome back to Deckawoo Drive for a sixth endearing installment in the companion series to Kate DiCamillo’s New York Times best-selling Mercy Watson books. Frank Endicott is a worrier. He worries about lions, submarines, black holes, leprosy, and armadillos. He lists his worries alphabetically in a notebook and suffers vivid nightmares that even a certain neighborhood pig can’t dispatch. When he accompanies Eugenia Lincoln on an errand to duplicate a key at her favorite dark and dusty thrift shop, Frank earns fresh cause for alarm. Odd Buddy Lamp, the shop’s proprietor, has sent them home with the original key and its copy. Can Frank come to terms with the mystery without buckling under his mounting dread? With a little help from friends (old and new), hot cocoa, and some classic short stories read aloud, the prognosis is good."
    },
    {
        "mmsId": "9952364023801401",
        "isbn": "9781524701291",
        "title": "Holler Of The Fireflies /",
        "author": "Moore, David Barclay,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781524701291-L.jpg",
        "summary": "A boy from the hood in Brooklyn travels to a STEM camp in an Appalachian holler for one epic, life-changing summer. A brilliant new novel from the award-winning author of The Stars Beneath Our Feet. Javari knew that West Virginia would be different from his home in Bushwick, Brooklyn. But his first day at STEM Camp in a little Appalachian town is still a shock. Though run-ins with the police are just the same here. Not good. Javari will learn a lot about science, tech, engineering, and math at camp. And also about rich people, racism, and hidden agendas. But it’s Cricket, a local boy, budding activist, and occasional thief, who will show him a different side of the holler—and blow his mind wide open. Javari is about to have that summer. Where everything gets messy and complicated and confusing . . . and you wouldn’t want it any other way. J + C + summer = ∞"
    },
    {
        "mmsId": "9952364024001401",
        "isbn": "9781481498982",
        "title": "Take Me Home Tonight /",
        "author": "Matson, Morgan,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781481498982-L.jpg",
        "summary": "Stevie and Kat, two high school seniors heavily involved in theater, leave Connecticut for a night of fun in New York City, but soon they find themselves without their phones or each other."
    },
    {
        "mmsId": "9952364024101401",
        "isbn": "9781452181554",
        "title": "The Way Past Winter /",
        "author": "Hargrave, Kiran Millwood,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781452181554-L.jpg",
        "summary": "\"Originally published in the United Kingdom in 2018 by Chicken House Ltd.\""
    },
    {
        "mmsId": "9952364024801401",
        "isbn": "9781335915849",
        "title": "If You Could See The Sun /",
        "author": "Liang, Ann,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781335915849-L.jpg",
        "summary": "\"Utterly unique, thought-provoking, and wonderfully written... a thrilling ride that hooked me from start to finish.\" --Gloria Chao, author of American Panda and Rent a Boyfriend In this genre-bending YA debut, a Chinese American girl monetizes her strange new invisibility powers by discovering and selling her wealthy classmates' most scandalous secrets. Alice Sun has always felt invisible at her elite Beijing international boarding school, where she's the only scholarship student among China's most rich and influential teens. But then she starts uncontrollably turning invisible--actually invisible. When her parents drop the news that they can no longer afford her tuition, even with the scholarship, Alice hatches a plan to monetize her strange new power--she'll discover the scandalous secrets her classmates want to know, for a price. But as the tasks escalate from petty scandals to actual crimes, Alice must decide if it's worth losing her conscience--or even her life."
    },
    {
        "mmsId": "9952364025401401",
        "isbn": "9780823444946",
        "title": "Brother's Keeper /",
        "author": "Lee, Julie,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780823444946-L.jpg",
        "summary": "With war looming on the horizon and winter setting in, can two children escape North Korea on their own? Winner of the Freeman Book Award! North Korea. December, 1950. Twelve-year-old Sora and her family live under an iron set of rules: No travel without a permit. No criticism of the government. No absences from Communist meetings. Wear red. Hang pictures of the Great Leader. Don't trust your neighbors. Don't speak your mind. You are being watched. But war is coming, war between North and South Korea, between the Soviets and the Americans. War causes chaos--and war is the perfect time to escape. The plan is simple: Sora and her family will walk hundreds of miles to the South Korean city of Busan from their tiny mountain village. They just need to avoid napalm, frostbite, border guards, and enemy soldiers. But they can't. And when an incendiary bombing changes everything, Sora and her little brother Young will have to get to Busan on their own. Can a twelve-year-old girl and her eight-year-old brother survive three hundred miles of warzone in winter? Haunting, timely, and beautiful, this harrowing novel from a searing new talent offers readers a glimpse into a vanished time and a closed nation. A Jane Addams Children's Book Award Finalist An ILA Intermediate Fiction Award Winner An American Library Association Notable Children’s Book A Kirkus Reviews Best Book of the Year A Junior Library Guild Selection A Bank Street Best Children's Book of the Year \"Will ultimately be recognized as one of the best books... on the Korean War.\"—Education About Asia, the Association for Asian Studies"
    },
    {
        "mmsId": "9952364026001401",
        "isbn": "9780762465477",
        "title": "In The Key Of Nira Ghani /",
        "author": "Deen, Natasha,",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780762465477-L.jpg",
        "summary": "A Guyanese girl must find the balance between her parents' \"old world\" expectations and traditions while pursuing her dream of being a great trumpeter in this contemporary, coming-of-age story, written by an #OwnVoices author. Nira Ghani has always dreamed of becoming a musician. Her Guyanese parents, however, have big plans for her to become a scientist or doctor. Nira's grandmother and her best friend, Emily, are the only people who seem to truly understand her desire to establish an identity outside of the one imposed on Nira by her parents. When auditions for jazz band are announced, Nira realizes it's now or never to convince her parents that she deserves a chance to pursue her passion. As if fighting with her parents weren't bad enough, Nira finds herself navigating a new friendship dynamic when her crush, Noah, and notorious mean-girl, McKenzie \"Mac,\" take a sudden interest in her and Emily, inserting themselves into the fold. So, too, does Nira's much cooler (and very competitive) cousin Farah. Is she trying to wiggle her way into the new group to get closer to Noah? Is McKenzie trying to steal Emily's attention away from her? As Farah and Noah grow closer and Emily begins to pull away, Nira's trusted trumpet \"George\" remains her constant, offering her an escape from family and school drama. But it isn't until Nira takes a step back that she realizes she's not the only one struggling to find her place in the world. As painful truths about her family are revealed, Nira learns to accept people for who they are and to open herself in ways she never thought possible. A relatable and timely contemporary, coming-of age story, In the Key of Nira Ghani explores the social and cultural struggles of a teen in an immigrant household."
    },
    {
        "mmsId": "9952369252301401",
        "isbn": "9781839763281",
        "title": "Bad Gays : A Homosexual History /",
        "author": "Lemmey, Huw, Author.",
        "recStatus": "Yes",
        "recDate": "2023-09-28",
        "callNo": "306.76609 L5548 2022",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781839763281-L.jpg",
        "summary": "An unconventional history of homosexuality We all remember Oscar Wilde, but who speaks for Bosie? What about those ‘bad gays’ whose unexemplary lives reveal more than we might expect? Many popular histories seek to establish homosexual heroes, pioneers, and martyrs but, as Huw Lemmey and Ben Miller argue, the past is filled with queer people whose sexualities and dastardly deeds have been overlooked despite their being informative and instructive. Based on the hugely popular podcast series of the same name, Bad Gays asks what we can learn about LGBTQ+ history, sexuality and identity through its villains, failures, and baddies. With characters such as the Emperor Hadrian, anthropologist Margaret Mead and notorious gangster Ronnie Kray, the authors tell the story of how the figure of the white gay man was born, and how he failed. They examine a cast of kings, fascist thugs, artists and debauched bon viveurs. Imperial-era figures Lawrence of Arabia and Roger Casement get a look-in, as do FBI boss J. Edgar Hoover, lawyer Roy Cohn, and architect Philip Johnson. Together these amazing life stories expand and challenge mainstream assumptions about sexual identity: showing that homosexuality itself was an idea that emerged in the nineteenth century, one central to major historical events. Bad Gays is a passionate argument for rethinking gay politics beyond questions of identity, compelling readers to search for solidarity across boundaries."
    },
    {
        "mmsId": "9952363888101401",
        "isbn": "9780593174357",
        "title": "Soul Lanterns /",
        "author": "Kuzki, Shaw,",
        "recStatus": "Yes",
        "recDate": "2023-09-27",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780593174357-L.jpg",
        "summary": "The haunting and poignant story of a how a young Japanese girl's understanding of the historic and tragic bombing of Hiroshima is transformed by a memorial lantern-floating ceremony. Twelve-year-old Nozomi lives in the Japanese city of Hiroshima. She wasn't even born when the bombing of Hiroshima took place. Every year Nozomi joins her family at the lantern-floating ceremony to honor those lost in the bombing. People write the names of their deceased loved ones along with messages of peace, on paper lanterns and set them afloat on the river. This year Nozomi realizes that her mother always releases one lantern with no name. She begins to ask questions, and when complicated stories of loss and loneliness unfold, Nozomi and her friends come up with a creative way to share their loved ones' experiences. By opening people's eyes to the struggles they all keep hidden, the project teaches the entire community new ways to show compassion. Soul Lanterns is an honest exploration of what happened on August 6, 1945, and offers readers a glimpse not only into the rich cultural history of Japan but also into the intimate lives of those who recognize--better than most--the urgent need for peace."
    },
    {
        "mmsId": "9952363888601401",
        "isbn": "9780593111284",
        "title": "The Many Meanings Of Meilan /",
        "author": "Wang, Andrea,",
        "recStatus": "Yes",
        "recDate": "2023-09-27",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780593111284-L.jpg",
        "summary": "“The little girl I was would have been thrilled to encounter Meilan... having found a character who embraces the complexity of being both Chinese and American, I would have been able to echo her words: 'I am not alone.'” —New York Times Book Review by Jean Kwok A family feud before the start of seventh grade propels Meilan from Boston's Chinatown to rural Ohio, where she must tap into her inner strength and sense of justice to make a new place for herself in this resonant debut. Meilan Hua's world is made up of a few key ingredients: her family's beloved matriarch, Nai Nai; the bakery her parents, aunts, and uncles own and run in Boston's Chinatown; and her favorite Chinese fairy tales. After Nai Nai passes, the family has a falling-out that sends Meilan, her parents, and her grieving grandfather on the road in search of a new home. They take a winding path across the country before landing in Redbud, Ohio. Everything in Redbud is the opposite of Chinatown, and Meilan's not quite sure who she is--being renamed at school only makes it worse. She decides she is many Meilans, each inspired by a different Chinese character with the same pronunciation as her name. Sometimes she is Mist, cooling and invisible; other times, she's Basket, carrying her parents' hopes and dreams and her guilt of not living up to them; and occasionally she is bright Blue, the way she feels around her new friend Logan. Meilan keeps her facets separate until an injustice at school shows her the power of bringing her many selves together. The Many Meanings of Meilan, written in stunning prose by Newbery Honor-winning author Andrea Wang, is an exploration of all the things it's possible to grieve, the injustices large and small that make us rage, and the peace that's unlocked when we learn to find home within ourselves."
    },
    {
        "mmsId": "9952363888701401",
        "isbn": "9780593108970",
        "title": "Watch Over Me /",
        "author": "Lacour, Nina,",
        "recStatus": "Yes",
        "recDate": "2023-09-27",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780593108970-L.jpg",
        "summary": "A modern ghost story about trauma and survival, Watch Over Me is the much-anticipated new novel from the Printz Award-winning author of We Are Okay ★ “Gripping; an emotion-packed must-read.” –Kirkus, starred review ★ “A painfully compelling gem from a masterful creator.” –Booklist, starred review ★ “Moving, unsettling, and full of atmospheric beauty.” –SLJ, starred review Mila is used to being alone. Maybe that’s why she said yes. Yes to a second chance in this remote place, among the flowers and the fog and the crash of waves far below. But she hadn’t known about the ghosts. Newly graduated from high school, Mila has aged out of the foster care system. So when she’s offered a teaching job and a place to live on an isolated part of the Northern California coast, she immediately accepts. Maybe she will finally find a new home—a real home. The farm is a refuge, but it’s also haunted by the past. And Mila’s own memories are starting to rise to the surface. Nina LaCour, the Printz Award–winning author of We Are Okay, delivers another emotional knockout with Watch Over Me about trauma and survival, chosen family and rebirth."
    },
    {
        "mmsId": "9952363890001401",
        "isbn": "9781984816191",
        "title": "Samira Surfs /",
        "author": "Guidroz, Rukhsanna,",
        "recStatus": "Yes",
        "recDate": "2023-09-27",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781984816191-L.jpg",
        "summary": "A middle grade novel in verse about Samira, an eleven-year-old Rohingya refugee living in Cox's Bazar, Bangladesh, who finds strength and sisterhood in a local surf club for girls. Samira thinks of her life as before and after: before the burning and violence in her village in Burma, when she and her best friend would play in the fields, and after, when her family was forced to flee. There's before the uncertain journey to Bangladesh by river, and after, when the river swallowed her nana and nani whole. And now, months after rebuilding a life in Bangladesh with her mama, baba, and brother, there's before Samira saw the Bengali surfer girls of Cox's Bazar, and after, when she decides she'll become one. Samira Surfs, written by Rukhsanna Guidroz with illustrations by Fahmida Azim, is a tender novel in verse about a young Rohingya girl's journey from isolation and persecution to sisterhood, and from fear to power."
    },
    {
        "mmsId": "9952363890301401",
        "isbn": "9780374388799",
        "title": "Ruby Finley Vs. The Interstellar Invasion /",
        "author": "Bradford, K Tempest,",
        "recStatus": "Yes",
        "recDate": "2023-09-27",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780374388799-L.jpg",
        "summary": "Eleven-year-old Ruby, a Black girl who loves studying insects, accidentally captures an alien bug, but when the creature escapes and starts wreaking havoc around the neighborhood, it is up to Ruby and her rag-tag group of friends to find this new invasive species before the feds do."
    },
    {
        "mmsId": "9952363890701401",
        "isbn": "9780374313746",
        "title": "Generation Misfits /",
        "author": "Bowman, Akemi Dawn,",
        "recStatus": "Yes",
        "recDate": "2023-09-27",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780374313746-L.jpg",
        "summary": "Akemi Dawn Bowman's Generation Misfits is a heartwarming, fish-out-of-water own voices middle grade debut about an eleven-year-old Japanese-American girl who finds her true friends when she joins her new school’s J-Pop club..."
    },
    {
        "mmsId": "9952363891001401",
        "isbn": "9780358325673",
        "title": "An Occasionally Happy Family /",
        "author": "Burke, Cliff,",
        "recStatus": "Yes",
        "recDate": "2023-09-27",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780358325673-L.jpg",
        "summary": "\"Coursing underneath this comically disastrous road trip romp is a painfully real and poignant reflection on how families find the strength to cope with loss. Funny and fast-paced (and occasionally happy), Theo's journey is one many young readers will relate to and enjoy.\"--John David Anderson, author of Ms. Bixby's Last Day and Posted Gordon Korman meets The Great Outdoors in this funny and moving debut about a boy who goes on a disastrous family vacation (sweltering heat! bear chases!) that ends with a terrible surprise: his dad's new girlfriend."
    },
    {
        "mmsId": "9952363891301401",
        "isbn": "9781772780543",
        "title": "Music For Tigers /",
        "author": "Kadarusman, Michelle,",
        "recStatus": "Yes",
        "recDate": "2023-09-27",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9781772780543-L.jpg",
        "summary": "A young violinist discovers her mother's family secretly harbor a sanctuary for extinct Tasmanian tigers in the remote Australian rainforest.-- \"Publisher\""
    },
    {
        "mmsId": "9952363891401401",
        "isbn": "9780316535458",
        "title": "Hazel Bly And The Deep Blue Sea /",
        "author": "Blake, Ashley Herring,",
        "recStatus": "Yes",
        "recDate": "2023-09-27",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780316535458-L.jpg",
        "summary": "For fans of Erin Entrada Kelly and Ali Benjamin comes a poignant yet hopeful novel about a girl navigating grief, trauma, and friendship, from Ashley Herring Blake, the award-winning author of Ivy Aberdeen's Letter to the World. Hazel Bly used to live in the perfect house with the perfect family in sunny California. But when a kayaking trip goes horribly wrong, Mum is suddenly gone forever and Hazel is left with crippling anxiety and a jagged scar on her face. After Mum's death, Hazel, her other mother, Mama, and her little sister, Peach, needed a fresh start. So for the last two years, the Bly girls have lived all over the country, never settling anywhere for more than a few months. When the family arrives in Rose Harbor, Maine, there's a wildness to the small town that feels like magic. But when Mama runs into an old childhood friend -- Claire -- suddenly Hazel's tight-knit world is infiltrated. To make it worse, she has a daughter Hazel's age, Lemon, who can't stop rambling on and on about the Rose Maid, a local 150-year-old mermaid myth. Soon, Hazel finds herself just as obsessed with the Rose Maid as Lemon is -- because what if magic were real? What if grief really could change you so much, you weren't even yourself anymore? And what if instead you emerged from the darkness stronger than before?"
    },
    {
        "mmsId": "9952363891801401",
        "isbn": "9780063116016",
        "title": "My Life Begins! /",
        "author": "Maclachlan, Patricia,",
        "recStatus": "Yes",
        "recDate": "2023-09-27",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780063116016-L.jpg",
        "summary": "From the celebrated author of Sarah, Plain and Tall, Patricia MacLachlan, comes another humorous and poignant early middle grade novel. My Life Begins! explores how life begins for Jacob when his triplet sisters are born, and how siblings get to know each other as time, and love, evolve. Jacob is nine years old when his life changes. He wants a litter of puppies. But instead his parents have a different surprise. Jacob will be an older brother soon. And there won't be only one new baby. There will be three! When the triplets are born, Jacob thinks puppies are cuter. The babies look identical to him and he gives them a name: \"the Trips.\" For a school science project, Jacob decides to study the Trips. It feels like magic as they begin to smile, talk, and grow. Slowly, he gets to know each of them. They call his mother \"Mama\" and his father \"Da.\" But what will they call him? One day, one of the Trips calls him \"Jay.\" As each of the triplets become unique and more special with each day, Jacob starts to wonder if \"the Trips\" is still a good name for them. They aren't puppies, or a bunch of bananas, and they aren't just \"the Trips\" anymore. What should he call them that will show what they mean to him? Can he figure out their \"forever name?\" And will he ever get a puppy?"
    },
    {
        "mmsId": "9952363893001401",
        "isbn": "9780063018525",
        "title": "Where The Rhythm Takes You /",
        "author": "Dass, Sarah,",
        "recStatus": "Yes",
        "recDate": "2023-09-27",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780063018525-L.jpg",
        "summary": "Synopsis coming soon......."
    },
    {
        "mmsId": "9952363894101401",
        "isbn": "9780062970428",
        "title": "Maybe Maybe Marisol Rainey /",
        "author": "Kelly, Erin Entrada,",
        "recStatus": "Yes",
        "recDate": "2023-09-27",
        "callNo": "Unknown",
        "coverurl": "https://covers.openlibrary.org/b/isbn/9780062970428-L.jpg",
        "summary": "\"Utterly endearing!\" --Annie Barrows, New York Times-bestselling author of the Ivy + Bean books \"Hilarious and heart-melting.\" --Sara Pennypacker, New York Times-bestselling author of Pax Introducing eight-year-old Marisol Rainey--an irresistible new character from Newbery Medalist and New York Times-bestselling Erin Entrada Kelly! Maybe, Maybe Marisol Rainey is an illustrated novel about summer, friendship, and overcoming fears, told with warm humor and undeniable appeal. Fans of Clementine, The Year of Billy Miller, and Ramona the Pest will be thrilled to meet Marisol. Marisol Rainey's mother was born in the Philippines. Marisol's father works and lives part-time on an oil rig in the Gulf of Mexico. And Marisol, who has a big imagination and likes to name inanimate objects, has a tree in her backyard she calls Peppina . . . but she's way too scared to climb it. This all makes Marisol the only girl in her small Louisiana town with a mother who was born elsewhere and a father who lives elsewhere (most of the time)--the only girl who's fearful of adventure and fun. Will Marisol be able to salvage her summer and have fun with Jada, her best friend? Maybe. Will Marisol figure out how to get annoying Evie Smythe to leave her alone? Maybe. Will Marisol ever get to spend enough real time with her father? Maybe. Will Marisol find the courage to climb Peppina? Maybe. Told in short chapters with illustrations by the author on nearly every page, Maybe, Maybe Marisol Rainey is a must-have for early elementary grade readers. Erin Entrada Kelly celebrates the small but mighty Marisol, the joys of friendship, and the triumph of overcoming your fears in this stunning new novel for readers of Kevin Henkes, Meg Medina, Andrew Clements, Sara Pennypacker, and Kate DiCamillo. Features black-and-white artwork throughout by Erin Entrada Kelly."
    }
]